/* automatically generated by rust-bindgen 0.65.1 */

/* Build script: ./gen-kernel-bindings.sh */
/* Kernel tag: v6.2 */

pub const LINUX_EPERM: u32 = 1;
pub const LINUX_ENOENT: u32 = 2;
pub const LINUX_ESRCH: u32 = 3;
pub const LINUX_EINTR: u32 = 4;
pub const LINUX_EIO: u32 = 5;
pub const LINUX_ENXIO: u32 = 6;
pub const LINUX_E2BIG: u32 = 7;
pub const LINUX_ENOEXEC: u32 = 8;
pub const LINUX_EBADF: u32 = 9;
pub const LINUX_ECHILD: u32 = 10;
pub const LINUX_EAGAIN: u32 = 11;
pub const LINUX_ENOMEM: u32 = 12;
pub const LINUX_EACCES: u32 = 13;
pub const LINUX_EFAULT: u32 = 14;
pub const LINUX_ENOTBLK: u32 = 15;
pub const LINUX_EBUSY: u32 = 16;
pub const LINUX_EEXIST: u32 = 17;
pub const LINUX_EXDEV: u32 = 18;
pub const LINUX_ENODEV: u32 = 19;
pub const LINUX_ENOTDIR: u32 = 20;
pub const LINUX_EISDIR: u32 = 21;
pub const LINUX_EINVAL: u32 = 22;
pub const LINUX_ENFILE: u32 = 23;
pub const LINUX_EMFILE: u32 = 24;
pub const LINUX_ENOTTY: u32 = 25;
pub const LINUX_ETXTBSY: u32 = 26;
pub const LINUX_EFBIG: u32 = 27;
pub const LINUX_ENOSPC: u32 = 28;
pub const LINUX_ESPIPE: u32 = 29;
pub const LINUX_EROFS: u32 = 30;
pub const LINUX_EMLINK: u32 = 31;
pub const LINUX_EPIPE: u32 = 32;
pub const LINUX_EDOM: u32 = 33;
pub const LINUX_ERANGE: u32 = 34;
pub const LINUX_EDEADLK: u32 = 35;
pub const LINUX_ENAMETOOLONG: u32 = 36;
pub const LINUX_ENOLCK: u32 = 37;
pub const LINUX_ENOSYS: u32 = 38;
pub const LINUX_ENOTEMPTY: u32 = 39;
pub const LINUX_ELOOP: u32 = 40;

pub const LINUX_TCGETX: u32 = 21554;
pub const LINUX_TCSETX: u32 = 21555;
pub const LINUX_TCSETXF: u32 = 21556;
pub const LINUX_TCSETXW: u32 = 21557;
pub const LINUX_TIOCVHANGUP: u32 = 21559;
pub const LINUX_FIONCLEX: u32 = 21584;
pub const LINUX_FIOCLEX: u32 = 21585;
pub const LINUX_FIOASYNC: u32 = 21586;
pub const LINUX_TIOCSERCONFIG: u32 = 21587;
pub const LINUX_TIOCSERGWILD: u32 = 21588;
pub const LINUX_TIOCSERSWILD: u32 = 21589;
pub const LINUX_TIOCGLCKTRMIOS: u32 = 21590;
pub const LINUX_TIOCSLCKTRMIOS: u32 = 21591;
pub const LINUX_TIOCSERGSTRUCT: u32 = 21592;
pub const LINUX_TIOCSERGETLSR: u32 = 21593;
pub const LINUX_TIOCSERGETMULTI: u32 = 21594;
pub const LINUX_TIOCSERSETMULTI: u32 = 21595;
pub const LINUX_TIOCMIWAIT: u32 = 21596;
pub const LINUX_TIOCGICOUNT: u32 = 21597;
pub const LINUX_FIOQSIZE: u32 = 21600;
pub const LINUX_TIOCPKT_DATA: u32 = 0;
pub const LINUX_TIOCPKT_FLUSHREAD: u32 = 1;
pub const LINUX_TIOCPKT_FLUSHWRITE: u32 = 2;
pub const LINUX_TIOCPKT_STOP: u32 = 4;
pub const LINUX_TIOCPKT_START: u32 = 8;
pub const LINUX_TIOCPKT_NOSTOP: u32 = 16;
pub const LINUX_TIOCPKT_DOSTOP: u32 = 32;
pub const LINUX_TIOCPKT_IOCTL: u32 = 64;
pub const LINUX_TIOCSER_TEMT: u32 = 1;
pub type linux___u16 = ::core::ffi::c_ushort;
pub type linux___u32 = ::core::ffi::c_uint;
pub type linux___u64 = ::core::ffi::c_ulonglong;
pub type linux___kernel_sighandler_t =
    ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_int)>;
pub type linux___kernel_key_t = ::core::ffi::c_int;
pub type linux___kernel_mqd_t = ::core::ffi::c_int;
pub type linux___kernel_old_uid_t = ::core::ffi::c_ushort;
pub type linux___kernel_old_gid_t = ::core::ffi::c_ushort;
pub type linux___kernel_old_dev_t = ::core::ffi::c_ulong;
pub type linux___kernel_long_t = ::core::ffi::c_long;
pub type linux___kernel_ulong_t = ::core::ffi::c_ulong;
pub type linux___kernel_ino_t = linux___kernel_ulong_t;
pub type linux___kernel_mode_t = ::core::ffi::c_uint;
pub type linux___kernel_pid_t = ::core::ffi::c_int;
pub type linux___kernel_ipc_pid_t = ::core::ffi::c_int;
pub type linux___kernel_uid_t = ::core::ffi::c_uint;
pub type linux___kernel_gid_t = ::core::ffi::c_uint;
pub type linux___kernel_suseconds_t = linux___kernel_long_t;
pub type linux___kernel_daddr_t = ::core::ffi::c_int;
pub type linux___kernel_uid32_t = ::core::ffi::c_uint;
pub type linux___kernel_gid32_t = ::core::ffi::c_uint;
pub type linux___kernel_size_t = linux___kernel_ulong_t;
pub type linux___kernel_ssize_t = linux___kernel_long_t;
pub type linux___kernel_ptrdiff_t = linux___kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___kernel_fsid_t {
    pub val: [::core::ffi::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___kernel_fsid_t() {
    const UNINIT: ::core::mem::MaybeUninit<linux___kernel_fsid_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___kernel_fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(linux___kernel_fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___kernel_fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(linux___kernel_fsid_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___kernel_fsid_t),
            "::",
            stringify!(val)
        )
    );
}
pub type linux___kernel_off_t = linux___kernel_long_t;
pub type linux___kernel_loff_t = ::core::ffi::c_longlong;
pub type linux___kernel_old_time_t = linux___kernel_long_t;
pub type linux___kernel_time_t = linux___kernel_long_t;
pub type linux___kernel_time64_t = ::core::ffi::c_longlong;
pub type linux___kernel_clock_t = linux___kernel_long_t;
pub type linux___kernel_timer_t = ::core::ffi::c_int;
pub type linux___kernel_clockid_t = ::core::ffi::c_int;
pub type linux___kernel_caddr_t = *mut ::core::ffi::c_char;
pub type linux___kernel_uid16_t = ::core::ffi::c_ushort;
pub type linux___kernel_gid16_t = ::core::ffi::c_ushort;
pub type linux___be16 = linux___u16;
pub type linux___be32 = linux___u32;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_flock {
    pub l_type: ::core::ffi::c_short,
    pub l_whence: ::core::ffi::c_short,
    pub l_start: linux___kernel_off_t,
    pub l_len: linux___kernel_off_t,
    pub l_pid: linux___kernel_pid_t,
}
#[test]
fn bindgen_test_layout_flock() {
    const UNINIT: ::core::mem::MaybeUninit<linux_flock> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_flock>(),
        32usize,
        concat!("Size of: ", stringify!(linux_flock))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_flock>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_flock))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock),
            "::",
            stringify!(l_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_whence) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock),
            "::",
            stringify!(l_whence)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock),
            "::",
            stringify!(l_start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock),
            "::",
            stringify!(l_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock),
            "::",
            stringify!(l_pid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_flock64 {
    pub l_type: ::core::ffi::c_short,
    pub l_whence: ::core::ffi::c_short,
    pub l_start: linux___kernel_loff_t,
    pub l_len: linux___kernel_loff_t,
    pub l_pid: linux___kernel_pid_t,
}
#[test]
fn bindgen_test_layout_flock64() {
    const UNINIT: ::core::mem::MaybeUninit<linux_flock64> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_flock64>(),
        32usize,
        concat!("Size of: ", stringify!(linux_flock64))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_flock64>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_flock64))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock64),
            "::",
            stringify!(l_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_whence) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock64),
            "::",
            stringify!(l_whence)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock64),
            "::",
            stringify!(l_start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock64),
            "::",
            stringify!(l_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock64),
            "::",
            stringify!(l_pid)
        )
    );
}
pub type linux___kernel_sa_family_t = ::core::ffi::c_ushort;
pub const LINUX_IPPROTO_IP: linux__bindgen_ty_1 = 0;
pub const LINUX_IPPROTO_ICMP: linux__bindgen_ty_1 = 1;
pub const LINUX_IPPROTO_IGMP: linux__bindgen_ty_1 = 2;
pub const LINUX_IPPROTO_IPIP: linux__bindgen_ty_1 = 4;
pub const LINUX_IPPROTO_TCP: linux__bindgen_ty_1 = 6;
pub const LINUX_IPPROTO_EGP: linux__bindgen_ty_1 = 8;
pub const LINUX_IPPROTO_PUP: linux__bindgen_ty_1 = 12;
pub const LINUX_IPPROTO_UDP: linux__bindgen_ty_1 = 17;
pub const LINUX_IPPROTO_IDP: linux__bindgen_ty_1 = 22;
pub const LINUX_IPPROTO_TP: linux__bindgen_ty_1 = 29;
pub const LINUX_IPPROTO_DCCP: linux__bindgen_ty_1 = 33;
pub const LINUX_IPPROTO_IPV6: linux__bindgen_ty_1 = 41;
pub const LINUX_IPPROTO_RSVP: linux__bindgen_ty_1 = 46;
pub const LINUX_IPPROTO_GRE: linux__bindgen_ty_1 = 47;
pub const LINUX_IPPROTO_ESP: linux__bindgen_ty_1 = 50;
pub const LINUX_IPPROTO_AH: linux__bindgen_ty_1 = 51;
pub const LINUX_IPPROTO_MTP: linux__bindgen_ty_1 = 92;
pub const LINUX_IPPROTO_BEETPH: linux__bindgen_ty_1 = 94;
pub const LINUX_IPPROTO_ENCAP: linux__bindgen_ty_1 = 98;
pub const LINUX_IPPROTO_PIM: linux__bindgen_ty_1 = 103;
pub const LINUX_IPPROTO_COMP: linux__bindgen_ty_1 = 108;
pub const LINUX_IPPROTO_L2TP: linux__bindgen_ty_1 = 115;
pub const LINUX_IPPROTO_SCTP: linux__bindgen_ty_1 = 132;
pub const LINUX_IPPROTO_UDPLITE: linux__bindgen_ty_1 = 136;
pub const LINUX_IPPROTO_MPLS: linux__bindgen_ty_1 = 137;
pub const LINUX_IPPROTO_ETHERNET: linux__bindgen_ty_1 = 143;
pub const LINUX_IPPROTO_RAW: linux__bindgen_ty_1 = 255;
pub const LINUX_IPPROTO_MPTCP: linux__bindgen_ty_1 = 262;
pub const LINUX_IPPROTO_MAX: linux__bindgen_ty_1 = 263;
pub type linux__bindgen_ty_1 = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_in_addr {
    pub s_addr: linux___be32,
}
#[test]
fn bindgen_test_layout_in_addr() {
    const UNINIT: ::core::mem::MaybeUninit<linux_in_addr> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(linux_in_addr))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(linux_in_addr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).s_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_in_addr),
            "::",
            stringify!(s_addr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_sockaddr_in {
    pub sin_family: linux___kernel_sa_family_t,
    pub sin_port: linux___be16,
    pub sin_addr: linux_in_addr,
    pub l__pad: [::core::ffi::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout_sockaddr_in() {
    const UNINIT: ::core::mem::MaybeUninit<linux_sockaddr_in> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_sockaddr_in>(),
        16usize,
        concat!("Size of: ", stringify!(linux_sockaddr_in))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_sockaddr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(linux_sockaddr_in))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sin_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sockaddr_in),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sin_port) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sockaddr_in),
            "::",
            stringify!(sin_port)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sin_addr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sockaddr_in),
            "::",
            stringify!(sin_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l__pad) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sockaddr_in),
            "::",
            stringify!(l__pad)
        )
    );
}
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_rseq {
    pub cpu_id_start: linux___u32,
    pub cpu_id: linux___u32,
    pub rseq_cs: linux___u64,
    pub flags: linux___u32,
}
#[test]
fn bindgen_test_layout_rseq() {
    const UNINIT: ::core::mem::MaybeUninit<linux_rseq> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_rseq>(),
        32usize,
        concat!("Size of: ", stringify!(linux_rseq))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_rseq>(),
        32usize,
        concat!("Alignment of ", stringify!(linux_rseq))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cpu_id_start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rseq),
            "::",
            stringify!(cpu_id_start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cpu_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rseq),
            "::",
            stringify!(cpu_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rseq_cs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rseq),
            "::",
            stringify!(rseq_cs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rseq),
            "::",
            stringify!(flags)
        )
    );
}
#[doc = " struct linux_clone_args - arguments for the clone3 syscall\n @flags:        Flags for the new process as listed above.\n                All flags are valid except for LINUX_CSIGNAL and\n                LINUX_CLONE_DETACHED.\n @pidfd:        If LINUX_CLONE_PIDFD is set, a pidfd will be\n                returned in this argument.\n @child_tid:    If LINUX_CLONE_CHILD_SETTID is set, the TID of the\n                child process will be returned in the child's\n                memory.\n @parent_tid:   If LINUX_CLONE_PARENT_SETTID is set, the TID of\n                the child process will be returned in the\n                parent's memory.\n @exit_signal:  The exit_signal the parent process will be\n                sent when the child exits.\n @stack:        Specify the location of the stack for the\n                child process.\n                Note, @stack is expected to point to the\n                lowest address. The stack direction will be\n                determined by the kernel and set up\n                appropriately based on @stack_size.\n @stack_size:   The size of the stack for the child process.\n @tls:          If LINUX_CLONE_SETTLS is set, the tls descriptor\n                is set to tls.\n @set_tid:      Pointer to an array of type *pid_t. The size\n                of the array is defined using @set_tid_size.\n                This array is used to select PIDs/TIDs for\n                newly created processes. The first element in\n                this defines the PID in the most nested PID\n                namespace. Each additional element in the array\n                defines the PID in the parent PID namespace of\n                the original PID namespace. If the array has\n                less entries than the number of currently\n                nested PID namespaces only the PIDs in the\n                corresponding namespaces are set.\n @set_tid_size: This defines the size of the array referenced\n                in @set_tid. This cannot be larger than the\n                kernel's limit of nested PID namespaces.\n @cgroup:       If LINUX_CLONE_INTO_CGROUP is specified set this to\n                a file descriptor for the cgroup.\n\n The structure is versioned by size and thus extensible.\n New struct members must go at the end of the struct and\n must be properly 64bit aligned."]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_clone_args {
    pub flags: linux___u64,
    pub pidfd: linux___u64,
    pub child_tid: linux___u64,
    pub parent_tid: linux___u64,
    pub exit_signal: linux___u64,
    pub stack: linux___u64,
    pub stack_size: linux___u64,
    pub tls: linux___u64,
    pub set_tid: linux___u64,
    pub set_tid_size: linux___u64,
    pub cgroup: linux___u64,
}
#[test]
fn bindgen_test_layout_clone_args() {
    const UNINIT: ::core::mem::MaybeUninit<linux_clone_args> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_clone_args>(),
        88usize,
        concat!("Size of: ", stringify!(linux_clone_args))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_clone_args>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_clone_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pidfd) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(pidfd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).child_tid) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(child_tid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).parent_tid) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(parent_tid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).exit_signal) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(exit_signal)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stack) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(stack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stack_size) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(stack_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tls) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(tls)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).set_tid) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(set_tid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).set_tid_size) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(set_tid_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cgroup) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(cgroup)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_timespec {
    pub tv_sec: linux___kernel_old_time_t,
    pub tv_nsec: ::core::ffi::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::core::mem::MaybeUninit<linux_timespec> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_timespec>(),
        16usize,
        concat!("Size of: ", stringify!(linux_timespec))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_timespec))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_timeval {
    pub tv_sec: linux___kernel_old_time_t,
    pub tv_usec: linux___kernel_suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::core::mem::MaybeUninit<linux_timeval> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_timeval>(),
        16usize,
        concat!("Size of: ", stringify!(linux_timeval))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_timeval))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_itimerspec {
    pub it_interval: linux_timespec,
    pub it_value: linux_timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    const UNINIT: ::core::mem::MaybeUninit<linux_itimerspec> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(linux_itimerspec))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_itimerspec))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_itimerval {
    pub it_interval: linux_timeval,
    pub it_value: linux_timeval,
}
#[test]
fn bindgen_test_layout_itimerval() {
    const UNINIT: ::core::mem::MaybeUninit<linux_itimerval> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_itimerval>(),
        32usize,
        concat!("Size of: ", stringify!(linux_itimerval))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_itimerval>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_itimerval))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_itimerval),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_itimerval),
            "::",
            stringify!(it_value)
        )
    );
}
pub type linux_sigset_t = ::core::ffi::c_ulong;
pub type linux___signalfn_t =
    ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_int)>;
pub type linux___sighandler_t = linux___signalfn_t;
pub type linux___restorefn_t = ::core::option::Option<unsafe extern "C" fn()>;
pub type linux___sigrestore_t = linux___restorefn_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_sigaction {
    pub lsa_handler: linux___sighandler_t,
    pub lsa_flags: ::core::ffi::c_ulong,
    pub lsa_restorer: linux___sigrestore_t,
    pub lsa_mask: linux_sigset_t,
}
#[test]
fn bindgen_test_layout_sigaction() {
    const UNINIT: ::core::mem::MaybeUninit<linux_sigaction> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_sigaction>(),
        32usize,
        concat!("Size of: ", stringify!(linux_sigaction))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_sigaction>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_sigaction))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsa_handler) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigaction),
            "::",
            stringify!(lsa_handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsa_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigaction),
            "::",
            stringify!(lsa_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsa_restorer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigaction),
            "::",
            stringify!(lsa_restorer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsa_mask) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigaction),
            "::",
            stringify!(lsa_mask)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union linux_sigval {
    pub sival_int: ::core::ffi::c_int,
    pub sival_ptr: *mut ::core::ffi::c_void,
}
#[test]
fn bindgen_test_layout_sigval() {
    const UNINIT: ::core::mem::MaybeUninit<linux_sigval> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_sigval>(),
        8usize,
        concat!("Size of: ", stringify!(linux_sigval))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_sigval>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_sigval))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sival_int) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigval),
            "::",
            stringify!(sival_int)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sival_ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigval),
            "::",
            stringify!(sival_ptr)
        )
    );
}
pub type linux_sigval_t = linux_sigval;
#[repr(C)]
#[derive(Copy, Clone)]
pub union linux___sifields {
    pub l_kill: linux___sifields__bindgen_ty_1,
    pub l_timer: linux___sifields__bindgen_ty_2,
    pub l_rt: linux___sifields__bindgen_ty_3,
    pub l_sigchld: linux___sifields__bindgen_ty_4,
    pub l_sigfault: linux___sifields__bindgen_ty_5,
    pub l_sigpoll: linux___sifields__bindgen_ty_6,
    pub l_sigsys: linux___sifields__bindgen_ty_7,
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_1 {
    pub l_pid: linux___kernel_pid_t,
    pub l_uid: linux___kernel_uid32_t,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_1),
            "::",
            stringify!(l_pid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_uid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_1),
            "::",
            stringify!(l_uid)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux___sifields__bindgen_ty_2 {
    pub l_tid: linux___kernel_timer_t,
    pub l_overrun: ::core::ffi::c_int,
    pub l_sigval: linux_sigval_t,
    pub l_sys_private: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_2>(),
        24usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_tid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_2),
            "::",
            stringify!(l_tid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_overrun) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_2),
            "::",
            stringify!(l_overrun)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sigval) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_2),
            "::",
            stringify!(l_sigval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sys_private) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_2),
            "::",
            stringify!(l_sys_private)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux___sifields__bindgen_ty_3 {
    pub l_pid: linux___kernel_pid_t,
    pub l_uid: linux___kernel_uid32_t,
    pub l_sigval: linux_sigval_t,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_3() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_3> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_3>(),
        16usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_3))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_3))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_3),
            "::",
            stringify!(l_pid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_uid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_3),
            "::",
            stringify!(l_uid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sigval) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_3),
            "::",
            stringify!(l_sigval)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_4 {
    pub l_pid: linux___kernel_pid_t,
    pub l_uid: linux___kernel_uid32_t,
    pub l_status: ::core::ffi::c_int,
    pub l_utime: linux___kernel_clock_t,
    pub l_stime: linux___kernel_clock_t,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_4() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_4> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_4>(),
        32usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_4))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_4))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_4),
            "::",
            stringify!(l_pid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_uid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_4),
            "::",
            stringify!(l_uid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_status) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_4),
            "::",
            stringify!(l_status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_utime) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_4),
            "::",
            stringify!(l_utime)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_stime) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_4),
            "::",
            stringify!(l_stime)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux___sifields__bindgen_ty_5 {
    pub l_addr: *mut ::core::ffi::c_void,
    pub l__bindgen_anon_1: linux___sifields__bindgen_ty_5__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union linux___sifields__bindgen_ty_5__bindgen_ty_1 {
    pub l_trapno: ::core::ffi::c_int,
    pub l_addr_lsb: ::core::ffi::c_short,
    pub l_addr_bnd: linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
    pub l_addr_pkey: linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2,
    pub l_perf: linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1 {
    pub l_dummy_bnd: [::core::ffi::c_char; 8usize],
    pub l_lower: *mut ::core::ffi::c_void,
    pub l_upper: *mut ::core::ffi::c_void,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<
        linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_dummy_bnd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(l_dummy_bnd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_lower) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(l_lower)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_upper) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(l_upper)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2 {
    pub l_dummy_pkey: [::core::ffi::c_char; 8usize],
    pub l_pkey: linux___u32,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<
        linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_dummy_pkey) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(l_dummy_pkey)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_pkey) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(l_pkey)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3 {
    pub l_data: ::core::ffi::c_ulong,
    pub l_type: linux___u32,
    pub l_flags: linux___u32,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::core::mem::MaybeUninit<
        linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(l_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(l_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_flags) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(l_flags)
        )
    );
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_5__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_5__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_trapno) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(l_trapno)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_addr_lsb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(l_addr_lsb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_addr_bnd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(l_addr_bnd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_addr_pkey) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(l_addr_pkey)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_perf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(l_perf)
        )
    );
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_5() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_5> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_5>(),
        32usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_5))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_5>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_5))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5),
            "::",
            stringify!(l_addr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_6 {
    pub l_band: ::core::ffi::c_long,
    pub l_fd: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_6() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_6> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_6>(),
        16usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_6))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_6>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_6))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_band) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_6),
            "::",
            stringify!(l_band)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_fd) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_6),
            "::",
            stringify!(l_fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_7 {
    pub l_call_addr: *mut ::core::ffi::c_void,
    pub l_syscall: ::core::ffi::c_int,
    pub l_arch: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_7() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_7> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_7>(),
        16usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_7))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_7>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_7))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_call_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_7),
            "::",
            stringify!(l_call_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_syscall) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_7),
            "::",
            stringify!(l_syscall)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_arch) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_7),
            "::",
            stringify!(l_arch)
        )
    );
}
#[test]
fn bindgen_test_layout___sifields() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields>(),
        32usize,
        concat!("Size of: ", stringify!(linux___sifields))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_kill) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_kill)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_timer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_timer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_rt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_rt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sigchld) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_sigchld)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sigfault) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_sigfault)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sigpoll) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_sigpoll)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sigsys) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_sigsys)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux_siginfo {
    pub l__bindgen_anon_1: linux_siginfo__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union linux_siginfo__bindgen_ty_1 {
    pub l__bindgen_anon_1: linux_siginfo__bindgen_ty_1__bindgen_ty_1,
    pub l_si_pad: [::core::ffi::c_int; 32usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux_siginfo__bindgen_ty_1__bindgen_ty_1 {
    pub lsi_signo: ::core::ffi::c_int,
    pub lsi_errno: ::core::ffi::c_int,
    pub lsi_code: ::core::ffi::c_int,
    pub l_sifields: linux___sifields,
}
#[test]
fn bindgen_test_layout_siginfo__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<linux_siginfo__bindgen_ty_1__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_siginfo__bindgen_ty_1__bindgen_ty_1>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(linux_siginfo__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<linux_siginfo__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(linux_siginfo__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsi_signo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_siginfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lsi_signo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsi_errno) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_siginfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lsi_errno)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsi_code) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_siginfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lsi_code)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sifields) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_siginfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(l_sifields)
        )
    );
}
#[test]
fn bindgen_test_layout_siginfo__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<linux_siginfo__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_siginfo__bindgen_ty_1>(),
        128usize,
        concat!("Size of: ", stringify!(linux_siginfo__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_siginfo__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_siginfo__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_si_pad) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_siginfo__bindgen_ty_1),
            "::",
            stringify!(l_si_pad)
        )
    );
}
#[test]
fn bindgen_test_layout_siginfo() {
    assert_eq!(
        ::core::mem::size_of::<linux_siginfo>(),
        128usize,
        concat!("Size of: ", stringify!(linux_siginfo))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_siginfo>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_siginfo))
    );
}
pub type linux_siginfo_t = linux_siginfo;
