/* automatically generated by rust-bindgen 0.65.1 */

/* Build script: ./gen-kernel-bindings.sh */
/* Kernel tag: v6.2 */

pub const LINUX___BITS_PER_LONG: u32 = 64;
pub const LINUX___FD_SETSIZE: u32 = 1024;
pub const LINUX__LINUX_CAPABILITY_VERSION_1: u32 = 429392688;
pub const LINUX__LINUX_CAPABILITY_U32S_1: u32 = 1;
pub const LINUX__LINUX_CAPABILITY_VERSION_2: u32 = 537333798;
pub const LINUX__LINUX_CAPABILITY_U32S_2: u32 = 2;
pub const LINUX__LINUX_CAPABILITY_VERSION_3: u32 = 537396514;
pub const LINUX__LINUX_CAPABILITY_U32S_3: u32 = 2;
pub const LINUX_VFS_CAP_REVISION_MASK: u32 = 4278190080;
pub const LINUX_VFS_CAP_REVISION_SHIFT: u32 = 24;
pub const LINUX_VFS_CAP_FLAGS_MASK: i64 = -4278190081;
pub const LINUX_VFS_CAP_FLAGS_EFFECTIVE: u32 = 1;
pub const LINUX_VFS_CAP_REVISION_1: u32 = 16777216;
pub const LINUX_VFS_CAP_U32_1: u32 = 1;
pub const LINUX_VFS_CAP_REVISION_2: u32 = 33554432;
pub const LINUX_VFS_CAP_U32_2: u32 = 2;
pub const LINUX_VFS_CAP_REVISION_3: u32 = 50331648;
pub const LINUX_VFS_CAP_U32_3: u32 = 2;
pub const LINUX_VFS_CAP_U32: u32 = 2;
pub const LINUX_VFS_CAP_REVISION: u32 = 50331648;
pub const LINUX__LINUX_CAPABILITY_VERSION: u32 = 429392688;
pub const LINUX__LINUX_CAPABILITY_U32S: u32 = 1;
pub const LINUX_CAP_CHOWN: u32 = 0;
pub const LINUX_CAP_DAC_OVERRIDE: u32 = 1;
pub const LINUX_CAP_DAC_READ_SEARCH: u32 = 2;
pub const LINUX_CAP_FOWNER: u32 = 3;
pub const LINUX_CAP_FSETID: u32 = 4;
pub const LINUX_CAP_KILL: u32 = 5;

pub const LINUX_EPOLLPRI: u32 = 2;
pub const LINUX_EPOLLOUT: u32 = 4;
pub const LINUX_EPOLLERR: u32 = 8;
pub const LINUX_EPOLLHUP: u32 = 16;
pub const LINUX_EPOLLNVAL: u32 = 32;
pub const LINUX_EPOLLRDNORM: u32 = 64;
pub const LINUX_EPOLLRDBAND: u32 = 128;
pub const LINUX_EPOLLWRNORM: u32 = 256;
pub const LINUX_EPOLLWRBAND: u32 = 512;
pub const LINUX_EPOLLMSG: u32 = 1024;
pub const LINUX_EPOLLRDHUP: u32 = 8192;
pub const LINUX_EPOLLEXCLUSIVE: u32 = 268435456;
pub const LINUX_EPOLLWAKEUP: u32 = 536870912;
pub const LINUX_EPOLLONESHOT: u32 = 1073741824;
pub const LINUX_EPOLLET: u32 = 2147483648;
pub const LINUX_SUID_DUMP_DISABLE: u32 = 0;
pub const LINUX_SUID_DUMP_USER: u32 = 1;
pub const LINUX_SUID_DUMP_ROOT: u32 = 2;
pub const LINUX_AF_UNSPEC: u32 = 0;
pub const LINUX_AF_UNIX: u32 = 1;
pub const LINUX_AF_LOCAL: u32 = 1;
pub const LINUX_AF_INET: u32 = 2;
pub const LINUX_AF_AX25: u32 = 3;
pub const LINUX_AF_IPX: u32 = 4;
pub const LINUX_AF_APPLETALK: u32 = 5;
pub const LINUX_AF_NETROM: u32 = 6;
pub const LINUX_AF_BRIDGE: u32 = 7;
pub const LINUX_AF_ATMPVC: u32 = 8;
pub const LINUX_AF_X25: u32 = 9;
pub const LINUX_AF_INET6: u32 = 10;
pub const LINUX_AF_ROSE: u32 = 11;
pub const LINUX_AF_DECnet: u32 = 12;
pub const LINUX_AF_NETBEUI: u32 = 13;
pub const LINUX_AF_SECURITY: u32 = 14;
pub const LINUX_AF_KEY: u32 = 15;
pub const LINUX_AF_NETLINK: u32 = 16;
pub const LINUX_AF_ROUTE: u32 = 16;
pub const LINUX_AF_PACKET: u32 = 17;
pub const LINUX_AF_ASH: u32 = 18;
pub const LINUX_AF_ECONET: u32 = 19;
pub const LINUX_AF_ATMSVC: u32 = 20;
pub const LINUX_AF_RDS: u32 = 21;
pub const LINUX_AF_SNA: u32 = 22;
pub const LINUX_AF_IRDA: u32 = 23;
pub const LINUX_AF_PPPOX: u32 = 24;
pub const LINUX_AF_WANPIPE: u32 = 25;
pub const LINUX_AF_LLC: u32 = 26;
pub const LINUX_AF_IB: u32 = 27;
pub const LINUX_AF_MPLS: u32 = 28;
pub const LINUX_AF_CAN: u32 = 29;
pub const LINUX_AF_TIPC: u32 = 30;
pub const LINUX_AF_BLUETOOTH: u32 = 31;
pub const LINUX_AF_IUCV: u32 = 32;
pub const LINUX_AF_RXRPC: u32 = 33;
pub const LINUX_AF_ISDN: u32 = 34;
pub const LINUX_AF_PHONET: u32 = 35;
pub const LINUX_AF_IEEE802154: u32 = 36;
pub const LINUX_AF_CAIF: u32 = 37;
pub const LINUX_AF_ALG: u32 = 38;
pub const LINUX_AF_NFC: u32 = 39;
pub const LINUX_AF_VSOCK: u32 = 40;
pub const LINUX_AF_KCM: u32 = 41;
pub const LINUX_AF_QIPCRTR: u32 = 42;
pub const LINUX_AF_SMC: u32 = 43;
pub const LINUX_AF_XDP: u32 = 44;
pub const LINUX_AF_MCTP: u32 = 45;
pub type linux___u16 = ::core::ffi::c_ushort;
pub type linux___u32 = ::core::ffi::c_uint;
pub type linux___u64 = ::core::ffi::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___kernel_fd_set {
    pub fds_bits: [::core::ffi::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___kernel_fd_set() {
    const UNINIT: ::core::mem::MaybeUninit<linux___kernel_fd_set> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___kernel_fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(linux___kernel_fd_set))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___kernel_fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___kernel_fd_set))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___kernel_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type linux___kernel_sighandler_t =
    ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_int)>;
pub type linux___kernel_key_t = ::core::ffi::c_int;
pub type linux___kernel_mqd_t = ::core::ffi::c_int;
pub type linux___kernel_old_uid_t = ::core::ffi::c_ushort;
pub type linux___kernel_old_gid_t = ::core::ffi::c_ushort;
pub type linux___kernel_old_dev_t = ::core::ffi::c_ulong;
pub type linux___kernel_long_t = ::core::ffi::c_long;
pub type linux___kernel_ulong_t = ::core::ffi::c_ulong;
pub type linux___kernel_ino_t = linux___kernel_ulong_t;
pub type linux___kernel_mode_t = ::core::ffi::c_uint;
pub type linux___kernel_pid_t = ::core::ffi::c_int;
pub type linux___kernel_ipc_pid_t = ::core::ffi::c_int;
pub type linux___kernel_uid_t = ::core::ffi::c_uint;
pub type linux___kernel_gid_t = ::core::ffi::c_uint;
pub type linux___kernel_suseconds_t = linux___kernel_long_t;
pub type linux___kernel_daddr_t = ::core::ffi::c_int;
pub type linux___kernel_uid32_t = ::core::ffi::c_uint;
pub type linux___kernel_gid32_t = ::core::ffi::c_uint;
pub type linux___kernel_size_t = linux___kernel_ulong_t;
pub type linux___kernel_ssize_t = linux___kernel_long_t;
pub type linux___kernel_ptrdiff_t = linux___kernel_long_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___kernel_fsid_t {
    pub val: [::core::ffi::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___kernel_fsid_t() {
    const UNINIT: ::core::mem::MaybeUninit<linux___kernel_fsid_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___kernel_fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(linux___kernel_fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___kernel_fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(linux___kernel_fsid_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___kernel_fsid_t),
            "::",
            stringify!(val)
        )
    );
}
pub type linux___kernel_off_t = linux___kernel_long_t;
pub type linux___kernel_loff_t = ::core::ffi::c_longlong;
pub type linux___kernel_old_time_t = linux___kernel_long_t;
pub type linux___kernel_time_t = linux___kernel_long_t;
pub type linux___kernel_time64_t = ::core::ffi::c_longlong;
pub type linux___kernel_clock_t = linux___kernel_long_t;
pub type linux___kernel_timer_t = ::core::ffi::c_int;
pub type linux___kernel_clockid_t = ::core::ffi::c_int;
pub type linux___kernel_caddr_t = *mut ::core::ffi::c_char;
pub type linux___kernel_uid16_t = ::core::ffi::c_ushort;
pub type linux___kernel_gid16_t = ::core::ffi::c_ushort;
pub type linux___be16 = linux___u16;
pub type linux___be32 = linux___u32;
pub type linux___poll_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_flock {
    pub l_type: ::core::ffi::c_short,
    pub l_whence: ::core::ffi::c_short,
    pub l_start: linux___kernel_off_t,
    pub l_len: linux___kernel_off_t,
    pub l_pid: linux___kernel_pid_t,
}
#[test]
fn bindgen_test_layout_flock() {
    const UNINIT: ::core::mem::MaybeUninit<linux_flock> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_flock>(),
        32usize,
        concat!("Size of: ", stringify!(linux_flock))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_flock>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_flock))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock),
            "::",
            stringify!(l_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_whence) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock),
            "::",
            stringify!(l_whence)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock),
            "::",
            stringify!(l_start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock),
            "::",
            stringify!(l_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock),
            "::",
            stringify!(l_pid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_flock64 {
    pub l_type: ::core::ffi::c_short,
    pub l_whence: ::core::ffi::c_short,
    pub l_start: linux___kernel_loff_t,
    pub l_len: linux___kernel_loff_t,
    pub l_pid: linux___kernel_pid_t,
}
#[test]
fn bindgen_test_layout_flock64() {
    const UNINIT: ::core::mem::MaybeUninit<linux_flock64> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_flock64>(),
        32usize,
        concat!("Size of: ", stringify!(linux_flock64))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_flock64>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_flock64))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock64),
            "::",
            stringify!(l_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_whence) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock64),
            "::",
            stringify!(l_whence)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock64),
            "::",
            stringify!(l_start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock64),
            "::",
            stringify!(l_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_flock64),
            "::",
            stringify!(l_pid)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_epoll_event {
    pub events: linux___poll_t,
    pub data: linux___u64,
}
#[test]
fn bindgen_test_layout_epoll_event() {
    const UNINIT: ::core::mem::MaybeUninit<linux_epoll_event> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_epoll_event>(),
        12usize,
        concat!("Size of: ", stringify!(linux_epoll_event))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_epoll_event>(),
        1usize,
        concat!("Alignment of ", stringify!(linux_epoll_event))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).events) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_epoll_event),
            "::",
            stringify!(events)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_epoll_event),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_robust_list {
    pub next: *mut linux_robust_list,
}
#[test]
fn bindgen_test_layout_robust_list() {
    const UNINIT: ::core::mem::MaybeUninit<linux_robust_list> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_robust_list>(),
        8usize,
        concat!("Size of: ", stringify!(linux_robust_list))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_robust_list>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_robust_list))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_robust_list),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_robust_list_head {
    pub list: linux_robust_list,
    pub futex_offset: ::core::ffi::c_long,
    pub list_op_pending: *mut linux_robust_list,
}
#[test]
fn bindgen_test_layout_robust_list_head() {
    const UNINIT: ::core::mem::MaybeUninit<linux_robust_list_head> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_robust_list_head>(),
        24usize,
        concat!("Size of: ", stringify!(linux_robust_list_head))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_robust_list_head>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_robust_list_head))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).list) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_robust_list_head),
            "::",
            stringify!(list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).futex_offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_robust_list_head),
            "::",
            stringify!(futex_offset)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).list_op_pending) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_robust_list_head),
            "::",
            stringify!(list_op_pending)
        )
    );
}
pub type linux___kernel_sa_family_t = ::core::ffi::c_ushort;
pub const LINUX_IPPROTO_IP: linux__bindgen_ty_1 = 0;
pub const LINUX_IPPROTO_ICMP: linux__bindgen_ty_1 = 1;
pub const LINUX_IPPROTO_IGMP: linux__bindgen_ty_1 = 2;
pub const LINUX_IPPROTO_IPIP: linux__bindgen_ty_1 = 4;
pub const LINUX_IPPROTO_TCP: linux__bindgen_ty_1 = 6;
pub const LINUX_IPPROTO_EGP: linux__bindgen_ty_1 = 8;
pub const LINUX_IPPROTO_PUP: linux__bindgen_ty_1 = 12;
pub const LINUX_IPPROTO_UDP: linux__bindgen_ty_1 = 17;
pub const LINUX_IPPROTO_IDP: linux__bindgen_ty_1 = 22;
pub const LINUX_IPPROTO_TP: linux__bindgen_ty_1 = 29;
pub const LINUX_IPPROTO_DCCP: linux__bindgen_ty_1 = 33;
pub const LINUX_IPPROTO_IPV6: linux__bindgen_ty_1 = 41;
pub const LINUX_IPPROTO_RSVP: linux__bindgen_ty_1 = 46;
pub const LINUX_IPPROTO_GRE: linux__bindgen_ty_1 = 47;
pub const LINUX_IPPROTO_ESP: linux__bindgen_ty_1 = 50;
pub const LINUX_IPPROTO_AH: linux__bindgen_ty_1 = 51;
pub const LINUX_IPPROTO_MTP: linux__bindgen_ty_1 = 92;
pub const LINUX_IPPROTO_BEETPH: linux__bindgen_ty_1 = 94;
pub const LINUX_IPPROTO_ENCAP: linux__bindgen_ty_1 = 98;
pub const LINUX_IPPROTO_PIM: linux__bindgen_ty_1 = 103;
pub const LINUX_IPPROTO_COMP: linux__bindgen_ty_1 = 108;
pub const LINUX_IPPROTO_L2TP: linux__bindgen_ty_1 = 115;
pub const LINUX_IPPROTO_SCTP: linux__bindgen_ty_1 = 132;
pub const LINUX_IPPROTO_UDPLITE: linux__bindgen_ty_1 = 136;
pub const LINUX_IPPROTO_MPLS: linux__bindgen_ty_1 = 137;
pub const LINUX_IPPROTO_ETHERNET: linux__bindgen_ty_1 = 143;
pub const LINUX_IPPROTO_RAW: linux__bindgen_ty_1 = 255;
pub const LINUX_IPPROTO_MPTCP: linux__bindgen_ty_1 = 262;
pub const LINUX_IPPROTO_MAX: linux__bindgen_ty_1 = 263;
pub type linux__bindgen_ty_1 = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_in_addr {
    pub s_addr: linux___be32,
}
#[test]
fn bindgen_test_layout_in_addr() {
    const UNINIT: ::core::mem::MaybeUninit<linux_in_addr> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(linux_in_addr))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(linux_in_addr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).s_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_in_addr),
            "::",
            stringify!(s_addr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_sockaddr_in {
    pub sin_family: linux___kernel_sa_family_t,
    pub sin_port: linux___be16,
    pub sin_addr: linux_in_addr,
    pub l__pad: [::core::ffi::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout_sockaddr_in() {
    const UNINIT: ::core::mem::MaybeUninit<linux_sockaddr_in> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_sockaddr_in>(),
        16usize,
        concat!("Size of: ", stringify!(linux_sockaddr_in))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_sockaddr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(linux_sockaddr_in))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sin_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sockaddr_in),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sin_port) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sockaddr_in),
            "::",
            stringify!(sin_port)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sin_addr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sockaddr_in),
            "::",
            stringify!(sin_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l__pad) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sockaddr_in),
            "::",
            stringify!(l__pad)
        )
    );
}
#[doc = " struct linux_nlmsghdr - fixed format metadata header of Netlink messages\n @nlmsg_len:   Length of message including header\n @nlmsg_type:  Message content type\n @nlmsg_flags: Additional flags\n @nlmsg_seq:   Sequence number\n @nlmsg_pid:   Sending process port ID"]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_nlmsghdr {
    pub nlmsg_len: linux___u32,
    pub nlmsg_type: linux___u16,
    pub nlmsg_flags: linux___u16,
    pub nlmsg_seq: linux___u32,
    pub nlmsg_pid: linux___u32,
}
#[test]
fn bindgen_test_layout_nlmsghdr() {
    const UNINIT: ::core::mem::MaybeUninit<linux_nlmsghdr> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_nlmsghdr>(),
        16usize,
        concat!("Size of: ", stringify!(linux_nlmsghdr))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_nlmsghdr>(),
        4usize,
        concat!("Alignment of ", stringify!(linux_nlmsghdr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nlmsg_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_nlmsghdr),
            "::",
            stringify!(nlmsg_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nlmsg_type) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_nlmsghdr),
            "::",
            stringify!(nlmsg_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nlmsg_flags) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_nlmsghdr),
            "::",
            stringify!(nlmsg_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nlmsg_seq) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_nlmsghdr),
            "::",
            stringify!(nlmsg_seq)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nlmsg_pid) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_nlmsghdr),
            "::",
            stringify!(nlmsg_pid)
        )
    );
}
pub const LINUX_NETLINK_UNCONNECTED: linux__bindgen_ty_2 = 0;
pub const LINUX_NETLINK_CONNECTED: linux__bindgen_ty_2 = 1;
pub type linux__bindgen_ty_2 = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___kernel_timespec {
    pub tv_sec: linux___kernel_time64_t,
    pub tv_nsec: ::core::ffi::c_longlong,
}
#[test]
fn bindgen_test_layout___kernel_timespec() {
    const UNINIT: ::core::mem::MaybeUninit<linux___kernel_timespec> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___kernel_timespec>(),
        16usize,
        concat!("Size of: ", stringify!(linux___kernel_timespec))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___kernel_timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___kernel_timespec))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___kernel_timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___kernel_timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___kernel_old_timeval {
    pub tv_sec: linux___kernel_long_t,
    pub tv_usec: linux___kernel_long_t,
}
#[test]
fn bindgen_test_layout___kernel_old_timeval() {
    const UNINIT: ::core::mem::MaybeUninit<linux___kernel_old_timeval> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___kernel_old_timeval>(),
        16usize,
        concat!("Size of: ", stringify!(linux___kernel_old_timeval))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___kernel_old_timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___kernel_old_timeval))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___kernel_old_timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___kernel_old_timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_timespec {
    pub tv_sec: linux___kernel_old_time_t,
    pub tv_nsec: ::core::ffi::c_long,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::core::mem::MaybeUninit<linux_timespec> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_timespec>(),
        16usize,
        concat!("Size of: ", stringify!(linux_timespec))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_timespec))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_timeval {
    pub tv_sec: linux___kernel_old_time_t,
    pub tv_usec: linux___kernel_suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::core::mem::MaybeUninit<linux_timeval> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_timeval>(),
        16usize,
        concat!("Size of: ", stringify!(linux_timeval))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_timeval))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_itimerspec {
    pub it_interval: linux_timespec,
    pub it_value: linux_timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    const UNINIT: ::core::mem::MaybeUninit<linux_itimerspec> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(linux_itimerspec))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_itimerspec))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_itimerval {
    pub it_interval: linux_timeval,
    pub it_value: linux_timeval,
}
#[test]
fn bindgen_test_layout_itimerval() {
    const UNINIT: ::core::mem::MaybeUninit<linux_itimerval> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_itimerval>(),
        32usize,
        concat!("Size of: ", stringify!(linux_itimerval))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_itimerval>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_itimerval))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_itimerval),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_itimerval),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_rusage {
    pub ru_utime: linux___kernel_old_timeval,
    pub ru_stime: linux___kernel_old_timeval,
    pub ru_maxrss: linux___kernel_long_t,
    pub ru_ixrss: linux___kernel_long_t,
    pub ru_idrss: linux___kernel_long_t,
    pub ru_isrss: linux___kernel_long_t,
    pub ru_minflt: linux___kernel_long_t,
    pub ru_majflt: linux___kernel_long_t,
    pub ru_nswap: linux___kernel_long_t,
    pub ru_inblock: linux___kernel_long_t,
    pub ru_oublock: linux___kernel_long_t,
    pub ru_msgsnd: linux___kernel_long_t,
    pub ru_msgrcv: linux___kernel_long_t,
    pub ru_nsignals: linux___kernel_long_t,
    pub ru_nvcsw: linux___kernel_long_t,
    pub ru_nivcsw: linux___kernel_long_t,
}
#[test]
fn bindgen_test_layout_rusage() {
    const UNINIT: ::core::mem::MaybeUninit<linux_rusage> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_rusage>(),
        144usize,
        concat!("Size of: ", stringify!(linux_rusage))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_rusage>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_rusage))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_utime) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_utime)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_stime) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_stime)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_maxrss) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_maxrss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_ixrss) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_ixrss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_idrss) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_idrss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_isrss) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_isrss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_minflt) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_minflt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_majflt) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_majflt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_nswap) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_nswap)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_inblock) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_inblock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_oublock) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_oublock)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_msgsnd) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_msgsnd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_msgrcv) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_msgrcv)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_nsignals) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_nsignals)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_nvcsw) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_nvcsw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ru_nivcsw) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rusage),
            "::",
            stringify!(ru_nivcsw)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_rlimit {
    pub rlim_cur: linux___kernel_ulong_t,
    pub rlim_max: linux___kernel_ulong_t,
}
#[test]
fn bindgen_test_layout_rlimit() {
    const UNINIT: ::core::mem::MaybeUninit<linux_rlimit> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_rlimit>(),
        16usize,
        concat!("Size of: ", stringify!(linux_rlimit))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_rlimit>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_rlimit))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rlim_cur) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rlimit),
            "::",
            stringify!(rlim_cur)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rlim_max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rlimit),
            "::",
            stringify!(rlim_max)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_rlimit64 {
    pub rlim_cur: linux___u64,
    pub rlim_max: linux___u64,
}
#[test]
fn bindgen_test_layout_rlimit64() {
    const UNINIT: ::core::mem::MaybeUninit<linux_rlimit64> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_rlimit64>(),
        16usize,
        concat!("Size of: ", stringify!(linux_rlimit64))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_rlimit64>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_rlimit64))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rlim_cur) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rlimit64),
            "::",
            stringify!(rlim_cur)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rlim_max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rlimit64),
            "::",
            stringify!(rlim_max)
        )
    );
}
#[repr(C)]
#[repr(align(32))]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_rseq {
    pub cpu_id_start: linux___u32,
    pub cpu_id: linux___u32,
    pub rseq_cs: linux___u64,
    pub flags: linux___u32,
}
#[test]
fn bindgen_test_layout_rseq() {
    const UNINIT: ::core::mem::MaybeUninit<linux_rseq> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_rseq>(),
        32usize,
        concat!("Size of: ", stringify!(linux_rseq))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_rseq>(),
        32usize,
        concat!("Alignment of ", stringify!(linux_rseq))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cpu_id_start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rseq),
            "::",
            stringify!(cpu_id_start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cpu_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rseq),
            "::",
            stringify!(cpu_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rseq_cs) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rseq),
            "::",
            stringify!(rseq_cs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_rseq),
            "::",
            stringify!(flags)
        )
    );
}
pub const LINUX_IFLA_UNSPEC: linux__bindgen_ty_3 = 0;
pub const LINUX_IFLA_ADDRESS: linux__bindgen_ty_3 = 1;
pub const LINUX_IFLA_BROADCAST: linux__bindgen_ty_3 = 2;
pub const LINUX_IFLA_IFNAME: linux__bindgen_ty_3 = 3;
pub const LINUX_IFLA_MTU: linux__bindgen_ty_3 = 4;
pub const LINUX_IFLA_LINK: linux__bindgen_ty_3 = 5;
pub const LINUX_IFLA_QDISC: linux__bindgen_ty_3 = 6;
pub const LINUX_IFLA_STATS: linux__bindgen_ty_3 = 7;
pub const LINUX_IFLA_COST: linux__bindgen_ty_3 = 8;
pub const LINUX_IFLA_PRIORITY: linux__bindgen_ty_3 = 9;
pub const LINUX_IFLA_MASTER: linux__bindgen_ty_3 = 10;
pub const LINUX_IFLA_WIRELESS: linux__bindgen_ty_3 = 11;
pub const LINUX_IFLA_PROTINFO: linux__bindgen_ty_3 = 12;
pub const LINUX_IFLA_TXQLEN: linux__bindgen_ty_3 = 13;
pub const LINUX_IFLA_MAP: linux__bindgen_ty_3 = 14;
pub const LINUX_IFLA_WEIGHT: linux__bindgen_ty_3 = 15;
pub const LINUX_IFLA_OPERSTATE: linux__bindgen_ty_3 = 16;
pub const LINUX_IFLA_LINKMODE: linux__bindgen_ty_3 = 17;
pub const LINUX_IFLA_LINKINFO: linux__bindgen_ty_3 = 18;
pub const LINUX_IFLA_NET_NS_PID: linux__bindgen_ty_3 = 19;
pub const LINUX_IFLA_IFALIAS: linux__bindgen_ty_3 = 20;
pub const LINUX_IFLA_NUM_VF: linux__bindgen_ty_3 = 21;
pub const LINUX_IFLA_VFINFO_LIST: linux__bindgen_ty_3 = 22;
pub const LINUX_IFLA_STATS64: linux__bindgen_ty_3 = 23;
pub const LINUX_IFLA_VF_PORTS: linux__bindgen_ty_3 = 24;
pub const LINUX_IFLA_PORT_SELF: linux__bindgen_ty_3 = 25;
pub const LINUX_IFLA_AF_SPEC: linux__bindgen_ty_3 = 26;
pub const LINUX_IFLA_GROUP: linux__bindgen_ty_3 = 27;
pub const LINUX_IFLA_NET_NS_FD: linux__bindgen_ty_3 = 28;
pub const LINUX_IFLA_EXT_MASK: linux__bindgen_ty_3 = 29;
pub const LINUX_IFLA_PROMISCUITY: linux__bindgen_ty_3 = 30;
pub const LINUX_IFLA_NUM_TX_QUEUES: linux__bindgen_ty_3 = 31;
pub const LINUX_IFLA_NUM_RX_QUEUES: linux__bindgen_ty_3 = 32;
pub const LINUX_IFLA_CARRIER: linux__bindgen_ty_3 = 33;
pub const LINUX_IFLA_PHYS_PORT_ID: linux__bindgen_ty_3 = 34;
pub const LINUX_IFLA_CARRIER_CHANGES: linux__bindgen_ty_3 = 35;
pub const LINUX_IFLA_PHYS_SWITCH_ID: linux__bindgen_ty_3 = 36;
pub const LINUX_IFLA_LINK_NETNSID: linux__bindgen_ty_3 = 37;
pub const LINUX_IFLA_PHYS_PORT_NAME: linux__bindgen_ty_3 = 38;
pub const LINUX_IFLA_PROTO_DOWN: linux__bindgen_ty_3 = 39;
pub const LINUX_IFLA_GSO_MAX_SEGS: linux__bindgen_ty_3 = 40;
pub const LINUX_IFLA_GSO_MAX_SIZE: linux__bindgen_ty_3 = 41;
pub const LINUX_IFLA_PAD: linux__bindgen_ty_3 = 42;
pub const LINUX_IFLA_XDP: linux__bindgen_ty_3 = 43;
pub const LINUX_IFLA_EVENT: linux__bindgen_ty_3 = 44;
pub const LINUX_IFLA_NEW_NETNSID: linux__bindgen_ty_3 = 45;
pub const LINUX_IFLA_IF_NETNSID: linux__bindgen_ty_3 = 46;
pub const LINUX_IFLA_TARGET_NETNSID: linux__bindgen_ty_3 = 46;
pub const LINUX_IFLA_CARRIER_UP_COUNT: linux__bindgen_ty_3 = 47;
pub const LINUX_IFLA_CARRIER_DOWN_COUNT: linux__bindgen_ty_3 = 48;
pub const LINUX_IFLA_NEW_IFINDEX: linux__bindgen_ty_3 = 49;
pub const LINUX_IFLA_MIN_MTU: linux__bindgen_ty_3 = 50;
pub const LINUX_IFLA_MAX_MTU: linux__bindgen_ty_3 = 51;
pub const LINUX_IFLA_PROP_LIST: linux__bindgen_ty_3 = 52;
pub const LINUX_IFLA_ALT_IFNAME: linux__bindgen_ty_3 = 53;
pub const LINUX_IFLA_PERM_ADDRESS: linux__bindgen_ty_3 = 54;
pub const LINUX_IFLA_PROTO_DOWN_REASON: linux__bindgen_ty_3 = 55;
pub const LINUX_IFLA_PARENT_DEV_NAME: linux__bindgen_ty_3 = 56;
pub const LINUX_IFLA_PARENT_DEV_BUS_NAME: linux__bindgen_ty_3 = 57;
pub const LINUX_IFLA_GRO_MAX_SIZE: linux__bindgen_ty_3 = 58;
pub const LINUX_IFLA_TSO_MAX_SIZE: linux__bindgen_ty_3 = 59;
pub const LINUX_IFLA_TSO_MAX_SEGS: linux__bindgen_ty_3 = 60;
pub const LINUX_IFLA_ALLMULTI: linux__bindgen_ty_3 = 61;
pub const LINUX_IFLA_DEVLINK_PORT: linux__bindgen_ty_3 = 62;
pub const LINUX___IFLA_MAX: linux__bindgen_ty_3 = 63;
pub type linux__bindgen_ty_3 = ::core::ffi::c_uint;
pub const LINUX_IFLA_PROTO_DOWN_REASON_UNSPEC: linux__bindgen_ty_4 = 0;
pub const LINUX_IFLA_PROTO_DOWN_REASON_MASK: linux__bindgen_ty_4 = 1;
pub const LINUX_IFLA_PROTO_DOWN_REASON_VALUE: linux__bindgen_ty_4 = 2;
pub const LINUX___IFLA_PROTO_DOWN_REASON_CNT: linux__bindgen_ty_4 = 3;
pub const LINUX_IFLA_PROTO_DOWN_REASON_MAX: linux__bindgen_ty_4 = 2;
pub type linux__bindgen_ty_4 = ::core::ffi::c_uint;
pub const LINUX_IFLA_INET_UNSPEC: linux__bindgen_ty_5 = 0;
pub const LINUX_IFLA_INET_CONF: linux__bindgen_ty_5 = 1;
pub const LINUX___IFLA_INET_MAX: linux__bindgen_ty_5 = 2;
pub type linux__bindgen_ty_5 = ::core::ffi::c_uint;
pub const LINUX_IFLA_INET6_UNSPEC: linux__bindgen_ty_6 = 0;
pub const LINUX_IFLA_INET6_FLAGS: linux__bindgen_ty_6 = 1;
pub const LINUX_IFLA_INET6_CONF: linux__bindgen_ty_6 = 2;
pub const LINUX_IFLA_INET6_STATS: linux__bindgen_ty_6 = 3;
pub const LINUX_IFLA_INET6_MCAST: linux__bindgen_ty_6 = 4;
pub const LINUX_IFLA_INET6_CACHEINFO: linux__bindgen_ty_6 = 5;
pub const LINUX_IFLA_INET6_ICMP6STATS: linux__bindgen_ty_6 = 6;
pub const LINUX_IFLA_INET6_TOKEN: linux__bindgen_ty_6 = 7;
pub const LINUX_IFLA_INET6_ADDR_GEN_MODE: linux__bindgen_ty_6 = 8;
pub const LINUX_IFLA_INET6_RA_MTU: linux__bindgen_ty_6 = 9;
pub const LINUX___IFLA_INET6_MAX: linux__bindgen_ty_6 = 10;
pub type linux__bindgen_ty_6 = ::core::ffi::c_uint;
pub const LINUX_IFLA_BR_UNSPEC: linux__bindgen_ty_7 = 0;
pub const LINUX_IFLA_BR_FORWARD_DELAY: linux__bindgen_ty_7 = 1;
pub const LINUX_IFLA_BR_HELLO_TIME: linux__bindgen_ty_7 = 2;
pub const LINUX_IFLA_BR_MAX_AGE: linux__bindgen_ty_7 = 3;
pub const LINUX_IFLA_BR_AGEING_TIME: linux__bindgen_ty_7 = 4;
pub const LINUX_IFLA_BR_STP_STATE: linux__bindgen_ty_7 = 5;
pub const LINUX_IFLA_BR_PRIORITY: linux__bindgen_ty_7 = 6;
pub const LINUX_IFLA_BR_VLAN_FILTERING: linux__bindgen_ty_7 = 7;
pub const LINUX_IFLA_BR_VLAN_PROTOCOL: linux__bindgen_ty_7 = 8;
pub const LINUX_IFLA_BR_GROUP_FWD_MASK: linux__bindgen_ty_7 = 9;
pub const LINUX_IFLA_BR_ROOT_ID: linux__bindgen_ty_7 = 10;
pub const LINUX_IFLA_BR_BRIDGE_ID: linux__bindgen_ty_7 = 11;
pub const LINUX_IFLA_BR_ROOT_PORT: linux__bindgen_ty_7 = 12;
pub const LINUX_IFLA_BR_ROOT_PATH_COST: linux__bindgen_ty_7 = 13;
pub const LINUX_IFLA_BR_TOPOLOGY_CHANGE: linux__bindgen_ty_7 = 14;
pub const LINUX_IFLA_BR_TOPOLOGY_CHANGE_DETECTED: linux__bindgen_ty_7 = 15;
pub const LINUX_IFLA_BR_HELLO_TIMER: linux__bindgen_ty_7 = 16;
pub const LINUX_IFLA_BR_TCN_TIMER: linux__bindgen_ty_7 = 17;
pub const LINUX_IFLA_BR_TOPOLOGY_CHANGE_TIMER: linux__bindgen_ty_7 = 18;
pub const LINUX_IFLA_BR_GC_TIMER: linux__bindgen_ty_7 = 19;
pub const LINUX_IFLA_BR_GROUP_ADDR: linux__bindgen_ty_7 = 20;
pub const LINUX_IFLA_BR_FDB_FLUSH: linux__bindgen_ty_7 = 21;
pub const LINUX_IFLA_BR_MCAST_ROUTER: linux__bindgen_ty_7 = 22;
pub const LINUX_IFLA_BR_MCAST_SNOOPING: linux__bindgen_ty_7 = 23;
pub const LINUX_IFLA_BR_MCAST_QUERY_USE_IFADDR: linux__bindgen_ty_7 = 24;
pub const LINUX_IFLA_BR_MCAST_QUERIER: linux__bindgen_ty_7 = 25;
pub const LINUX_IFLA_BR_MCAST_HASH_ELASTICITY: linux__bindgen_ty_7 = 26;
pub const LINUX_IFLA_BR_MCAST_HASH_MAX: linux__bindgen_ty_7 = 27;
pub const LINUX_IFLA_BR_MCAST_LAST_MEMBER_CNT: linux__bindgen_ty_7 = 28;
pub const LINUX_IFLA_BR_MCAST_STARTUP_QUERY_CNT: linux__bindgen_ty_7 = 29;
pub const LINUX_IFLA_BR_MCAST_LAST_MEMBER_INTVL: linux__bindgen_ty_7 = 30;
pub const LINUX_IFLA_BR_MCAST_MEMBERSHIP_INTVL: linux__bindgen_ty_7 = 31;
pub const LINUX_IFLA_BR_MCAST_QUERIER_INTVL: linux__bindgen_ty_7 = 32;
pub const LINUX_IFLA_BR_MCAST_QUERY_INTVL: linux__bindgen_ty_7 = 33;
pub const LINUX_IFLA_BR_MCAST_QUERY_RESPONSE_INTVL: linux__bindgen_ty_7 = 34;
pub const LINUX_IFLA_BR_MCAST_STARTUP_QUERY_INTVL: linux__bindgen_ty_7 = 35;
pub const LINUX_IFLA_BR_NF_CALL_IPTABLES: linux__bindgen_ty_7 = 36;
pub const LINUX_IFLA_BR_NF_CALL_IP6TABLES: linux__bindgen_ty_7 = 37;
pub const LINUX_IFLA_BR_NF_CALL_ARPTABLES: linux__bindgen_ty_7 = 38;
pub const LINUX_IFLA_BR_VLAN_DEFAULT_PVID: linux__bindgen_ty_7 = 39;
pub const LINUX_IFLA_BR_PAD: linux__bindgen_ty_7 = 40;
pub const LINUX_IFLA_BR_VLAN_STATS_ENABLED: linux__bindgen_ty_7 = 41;
pub const LINUX_IFLA_BR_MCAST_STATS_ENABLED: linux__bindgen_ty_7 = 42;
pub const LINUX_IFLA_BR_MCAST_IGMP_VERSION: linux__bindgen_ty_7 = 43;
pub const LINUX_IFLA_BR_MCAST_MLD_VERSION: linux__bindgen_ty_7 = 44;
pub const LINUX_IFLA_BR_VLAN_STATS_PER_PORT: linux__bindgen_ty_7 = 45;
pub const LINUX_IFLA_BR_MULTI_BOOLOPT: linux__bindgen_ty_7 = 46;
pub const LINUX_IFLA_BR_MCAST_QUERIER_STATE: linux__bindgen_ty_7 = 47;
pub const LINUX___IFLA_BR_MAX: linux__bindgen_ty_7 = 48;
pub type linux__bindgen_ty_7 = ::core::ffi::c_uint;
pub const LINUX_BRIDGE_MODE_UNSPEC: linux__bindgen_ty_8 = 0;
pub const LINUX_BRIDGE_MODE_HAIRPIN: linux__bindgen_ty_8 = 1;
pub type linux__bindgen_ty_8 = ::core::ffi::c_uint;
pub const LINUX_IFLA_BRPORT_UNSPEC: linux__bindgen_ty_9 = 0;
pub const LINUX_IFLA_BRPORT_STATE: linux__bindgen_ty_9 = 1;
pub const LINUX_IFLA_BRPORT_PRIORITY: linux__bindgen_ty_9 = 2;
pub const LINUX_IFLA_BRPORT_COST: linux__bindgen_ty_9 = 3;
pub const LINUX_IFLA_BRPORT_MODE: linux__bindgen_ty_9 = 4;
pub const LINUX_IFLA_BRPORT_GUARD: linux__bindgen_ty_9 = 5;
pub const LINUX_IFLA_BRPORT_PROTECT: linux__bindgen_ty_9 = 6;
pub const LINUX_IFLA_BRPORT_FAST_LEAVE: linux__bindgen_ty_9 = 7;
pub const LINUX_IFLA_BRPORT_LEARNING: linux__bindgen_ty_9 = 8;
pub const LINUX_IFLA_BRPORT_UNICAST_FLOOD: linux__bindgen_ty_9 = 9;
pub const LINUX_IFLA_BRPORT_PROXYARP: linux__bindgen_ty_9 = 10;
pub const LINUX_IFLA_BRPORT_LEARNING_SYNC: linux__bindgen_ty_9 = 11;
pub const LINUX_IFLA_BRPORT_PROXYARP_WIFI: linux__bindgen_ty_9 = 12;
pub const LINUX_IFLA_BRPORT_ROOT_ID: linux__bindgen_ty_9 = 13;
pub const LINUX_IFLA_BRPORT_BRIDGE_ID: linux__bindgen_ty_9 = 14;
pub const LINUX_IFLA_BRPORT_DESIGNATED_PORT: linux__bindgen_ty_9 = 15;
pub const LINUX_IFLA_BRPORT_DESIGNATED_COST: linux__bindgen_ty_9 = 16;
pub const LINUX_IFLA_BRPORT_ID: linux__bindgen_ty_9 = 17;
pub const LINUX_IFLA_BRPORT_NO: linux__bindgen_ty_9 = 18;
pub const LINUX_IFLA_BRPORT_TOPOLOGY_CHANGE_ACK: linux__bindgen_ty_9 = 19;
pub const LINUX_IFLA_BRPORT_CONFIG_PENDING: linux__bindgen_ty_9 = 20;
pub const LINUX_IFLA_BRPORT_MESSAGE_AGE_TIMER: linux__bindgen_ty_9 = 21;
pub const LINUX_IFLA_BRPORT_FORWARD_DELAY_TIMER: linux__bindgen_ty_9 = 22;
pub const LINUX_IFLA_BRPORT_HOLD_TIMER: linux__bindgen_ty_9 = 23;
pub const LINUX_IFLA_BRPORT_FLUSH: linux__bindgen_ty_9 = 24;
pub const LINUX_IFLA_BRPORT_MULTICAST_ROUTER: linux__bindgen_ty_9 = 25;
pub const LINUX_IFLA_BRPORT_PAD: linux__bindgen_ty_9 = 26;
pub const LINUX_IFLA_BRPORT_MCAST_FLOOD: linux__bindgen_ty_9 = 27;
pub const LINUX_IFLA_BRPORT_MCAST_TO_UCAST: linux__bindgen_ty_9 = 28;
pub const LINUX_IFLA_BRPORT_VLAN_TUNNEL: linux__bindgen_ty_9 = 29;
pub const LINUX_IFLA_BRPORT_BCAST_FLOOD: linux__bindgen_ty_9 = 30;
pub const LINUX_IFLA_BRPORT_GROUP_FWD_MASK: linux__bindgen_ty_9 = 31;
pub const LINUX_IFLA_BRPORT_NEIGH_SUPPRESS: linux__bindgen_ty_9 = 32;
pub const LINUX_IFLA_BRPORT_ISOLATED: linux__bindgen_ty_9 = 33;
pub const LINUX_IFLA_BRPORT_BACKUP_PORT: linux__bindgen_ty_9 = 34;
pub const LINUX_IFLA_BRPORT_MRP_RING_OPEN: linux__bindgen_ty_9 = 35;
pub const LINUX_IFLA_BRPORT_MRP_IN_OPEN: linux__bindgen_ty_9 = 36;
pub const LINUX_IFLA_BRPORT_MCAST_EHT_HOSTS_LIMIT: linux__bindgen_ty_9 = 37;
pub const LINUX_IFLA_BRPORT_MCAST_EHT_HOSTS_CNT: linux__bindgen_ty_9 = 38;
pub const LINUX_IFLA_BRPORT_LOCKED: linux__bindgen_ty_9 = 39;
pub const LINUX_IFLA_BRPORT_MAB: linux__bindgen_ty_9 = 40;
pub const LINUX___IFLA_BRPORT_MAX: linux__bindgen_ty_9 = 41;
pub type linux__bindgen_ty_9 = ::core::ffi::c_uint;
pub const LINUX_IFLA_INFO_UNSPEC: linux__bindgen_ty_10 = 0;
pub const LINUX_IFLA_INFO_KIND: linux__bindgen_ty_10 = 1;
pub const LINUX_IFLA_INFO_DATA: linux__bindgen_ty_10 = 2;
pub const LINUX_IFLA_INFO_XSTATS: linux__bindgen_ty_10 = 3;
pub const LINUX_IFLA_INFO_SLAVE_KIND: linux__bindgen_ty_10 = 4;
pub const LINUX_IFLA_INFO_SLAVE_DATA: linux__bindgen_ty_10 = 5;
pub const LINUX___IFLA_INFO_MAX: linux__bindgen_ty_10 = 6;
pub type linux__bindgen_ty_10 = ::core::ffi::c_uint;
pub const LINUX_IFLA_VLAN_UNSPEC: linux__bindgen_ty_11 = 0;
pub const LINUX_IFLA_VLAN_ID: linux__bindgen_ty_11 = 1;
pub const LINUX_IFLA_VLAN_FLAGS: linux__bindgen_ty_11 = 2;
pub const LINUX_IFLA_VLAN_EGRESS_QOS: linux__bindgen_ty_11 = 3;
pub const LINUX_IFLA_VLAN_INGRESS_QOS: linux__bindgen_ty_11 = 4;
pub const LINUX_IFLA_VLAN_PROTOCOL: linux__bindgen_ty_11 = 5;
pub const LINUX___IFLA_VLAN_MAX: linux__bindgen_ty_11 = 6;
pub type linux__bindgen_ty_11 = ::core::ffi::c_uint;
pub const LINUX_IFLA_VLAN_QOS_UNSPEC: linux__bindgen_ty_12 = 0;
pub const LINUX_IFLA_VLAN_QOS_MAPPING: linux__bindgen_ty_12 = 1;
pub const LINUX___IFLA_VLAN_QOS_MAX: linux__bindgen_ty_12 = 2;
pub type linux__bindgen_ty_12 = ::core::ffi::c_uint;
pub const LINUX_IFLA_MACVLAN_UNSPEC: linux__bindgen_ty_13 = 0;
pub const LINUX_IFLA_MACVLAN_MODE: linux__bindgen_ty_13 = 1;
pub const LINUX_IFLA_MACVLAN_FLAGS: linux__bindgen_ty_13 = 2;
pub const LINUX_IFLA_MACVLAN_MACADDR_MODE: linux__bindgen_ty_13 = 3;
pub const LINUX_IFLA_MACVLAN_MACADDR: linux__bindgen_ty_13 = 4;
pub const LINUX_IFLA_MACVLAN_MACADDR_DATA: linux__bindgen_ty_13 = 5;
pub const LINUX_IFLA_MACVLAN_MACADDR_COUNT: linux__bindgen_ty_13 = 6;
pub const LINUX_IFLA_MACVLAN_BC_QUEUE_LEN: linux__bindgen_ty_13 = 7;
pub const LINUX_IFLA_MACVLAN_BC_QUEUE_LEN_USED: linux__bindgen_ty_13 = 8;
pub const LINUX___IFLA_MACVLAN_MAX: linux__bindgen_ty_13 = 9;
pub type linux__bindgen_ty_13 = ::core::ffi::c_uint;
pub const LINUX_IFLA_VRF_UNSPEC: linux__bindgen_ty_14 = 0;
pub const LINUX_IFLA_VRF_TABLE: linux__bindgen_ty_14 = 1;
pub const LINUX___IFLA_VRF_MAX: linux__bindgen_ty_14 = 2;
pub type linux__bindgen_ty_14 = ::core::ffi::c_uint;
pub const LINUX_IFLA_VRF_PORT_UNSPEC: linux__bindgen_ty_15 = 0;
pub const LINUX_IFLA_VRF_PORT_TABLE: linux__bindgen_ty_15 = 1;
pub const LINUX___IFLA_VRF_PORT_MAX: linux__bindgen_ty_15 = 2;
pub type linux__bindgen_ty_15 = ::core::ffi::c_uint;
pub const LINUX_IFLA_MACSEC_UNSPEC: linux__bindgen_ty_16 = 0;
pub const LINUX_IFLA_MACSEC_SCI: linux__bindgen_ty_16 = 1;
pub const LINUX_IFLA_MACSEC_PORT: linux__bindgen_ty_16 = 2;
pub const LINUX_IFLA_MACSEC_ICV_LEN: linux__bindgen_ty_16 = 3;
pub const LINUX_IFLA_MACSEC_CIPHER_SUITE: linux__bindgen_ty_16 = 4;
pub const LINUX_IFLA_MACSEC_WINDOW: linux__bindgen_ty_16 = 5;
pub const LINUX_IFLA_MACSEC_ENCODING_SA: linux__bindgen_ty_16 = 6;
pub const LINUX_IFLA_MACSEC_ENCRYPT: linux__bindgen_ty_16 = 7;
pub const LINUX_IFLA_MACSEC_PROTECT: linux__bindgen_ty_16 = 8;
pub const LINUX_IFLA_MACSEC_INC_SCI: linux__bindgen_ty_16 = 9;
pub const LINUX_IFLA_MACSEC_ES: linux__bindgen_ty_16 = 10;
pub const LINUX_IFLA_MACSEC_SCB: linux__bindgen_ty_16 = 11;
pub const LINUX_IFLA_MACSEC_REPLAY_PROTECT: linux__bindgen_ty_16 = 12;
pub const LINUX_IFLA_MACSEC_VALIDATION: linux__bindgen_ty_16 = 13;
pub const LINUX_IFLA_MACSEC_PAD: linux__bindgen_ty_16 = 14;
pub const LINUX_IFLA_MACSEC_OFFLOAD: linux__bindgen_ty_16 = 15;
pub const LINUX___IFLA_MACSEC_MAX: linux__bindgen_ty_16 = 16;
pub type linux__bindgen_ty_16 = ::core::ffi::c_uint;
pub const LINUX_IFLA_XFRM_UNSPEC: linux__bindgen_ty_17 = 0;
pub const LINUX_IFLA_XFRM_LINK: linux__bindgen_ty_17 = 1;
pub const LINUX_IFLA_XFRM_IF_ID: linux__bindgen_ty_17 = 2;
pub const LINUX_IFLA_XFRM_COLLECT_METADATA: linux__bindgen_ty_17 = 3;
pub const LINUX___IFLA_XFRM_MAX: linux__bindgen_ty_17 = 4;
pub type linux__bindgen_ty_17 = ::core::ffi::c_uint;
pub const LINUX_IFLA_IPVLAN_UNSPEC: linux__bindgen_ty_18 = 0;
pub const LINUX_IFLA_IPVLAN_MODE: linux__bindgen_ty_18 = 1;
pub const LINUX_IFLA_IPVLAN_FLAGS: linux__bindgen_ty_18 = 2;
pub const LINUX___IFLA_IPVLAN_MAX: linux__bindgen_ty_18 = 3;
pub type linux__bindgen_ty_18 = ::core::ffi::c_uint;
pub const LINUX_VNIFILTER_ENTRY_STATS_UNSPEC: linux__bindgen_ty_19 = 0;
pub const LINUX_VNIFILTER_ENTRY_STATS_RX_BYTES: linux__bindgen_ty_19 = 1;
pub const LINUX_VNIFILTER_ENTRY_STATS_RX_PKTS: linux__bindgen_ty_19 = 2;
pub const LINUX_VNIFILTER_ENTRY_STATS_RX_DROPS: linux__bindgen_ty_19 = 3;
pub const LINUX_VNIFILTER_ENTRY_STATS_RX_ERRORS: linux__bindgen_ty_19 = 4;
pub const LINUX_VNIFILTER_ENTRY_STATS_TX_BYTES: linux__bindgen_ty_19 = 5;
pub const LINUX_VNIFILTER_ENTRY_STATS_TX_PKTS: linux__bindgen_ty_19 = 6;
pub const LINUX_VNIFILTER_ENTRY_STATS_TX_DROPS: linux__bindgen_ty_19 = 7;
pub const LINUX_VNIFILTER_ENTRY_STATS_TX_ERRORS: linux__bindgen_ty_19 = 8;
pub const LINUX_VNIFILTER_ENTRY_STATS_PAD: linux__bindgen_ty_19 = 9;
pub const LINUX___VNIFILTER_ENTRY_STATS_MAX: linux__bindgen_ty_19 = 10;
pub type linux__bindgen_ty_19 = ::core::ffi::c_uint;
pub const LINUX_VXLAN_VNIFILTER_ENTRY_UNSPEC: linux__bindgen_ty_20 = 0;
pub const LINUX_VXLAN_VNIFILTER_ENTRY_START: linux__bindgen_ty_20 = 1;
pub const LINUX_VXLAN_VNIFILTER_ENTRY_END: linux__bindgen_ty_20 = 2;
pub const LINUX_VXLAN_VNIFILTER_ENTRY_GROUP: linux__bindgen_ty_20 = 3;
pub const LINUX_VXLAN_VNIFILTER_ENTRY_GROUP6: linux__bindgen_ty_20 = 4;
pub const LINUX_VXLAN_VNIFILTER_ENTRY_STATS: linux__bindgen_ty_20 = 5;
pub const LINUX___VXLAN_VNIFILTER_ENTRY_MAX: linux__bindgen_ty_20 = 6;
pub type linux__bindgen_ty_20 = ::core::ffi::c_uint;
pub const LINUX_VXLAN_VNIFILTER_UNSPEC: linux__bindgen_ty_21 = 0;
pub const LINUX_VXLAN_VNIFILTER_ENTRY: linux__bindgen_ty_21 = 1;
pub const LINUX___VXLAN_VNIFILTER_MAX: linux__bindgen_ty_21 = 2;
pub type linux__bindgen_ty_21 = ::core::ffi::c_uint;
pub const LINUX_IFLA_VXLAN_UNSPEC: linux__bindgen_ty_22 = 0;
pub const LINUX_IFLA_VXLAN_ID: linux__bindgen_ty_22 = 1;
pub const LINUX_IFLA_VXLAN_GROUP: linux__bindgen_ty_22 = 2;
pub const LINUX_IFLA_VXLAN_LINK: linux__bindgen_ty_22 = 3;
pub const LINUX_IFLA_VXLAN_LOCAL: linux__bindgen_ty_22 = 4;
pub const LINUX_IFLA_VXLAN_TTL: linux__bindgen_ty_22 = 5;
pub const LINUX_IFLA_VXLAN_TOS: linux__bindgen_ty_22 = 6;
pub const LINUX_IFLA_VXLAN_LEARNING: linux__bindgen_ty_22 = 7;
pub const LINUX_IFLA_VXLAN_AGEING: linux__bindgen_ty_22 = 8;
pub const LINUX_IFLA_VXLAN_LIMIT: linux__bindgen_ty_22 = 9;
pub const LINUX_IFLA_VXLAN_PORT_RANGE: linux__bindgen_ty_22 = 10;
pub const LINUX_IFLA_VXLAN_PROXY: linux__bindgen_ty_22 = 11;
pub const LINUX_IFLA_VXLAN_RSC: linux__bindgen_ty_22 = 12;
pub const LINUX_IFLA_VXLAN_L2MISS: linux__bindgen_ty_22 = 13;
pub const LINUX_IFLA_VXLAN_L3MISS: linux__bindgen_ty_22 = 14;
pub const LINUX_IFLA_VXLAN_PORT: linux__bindgen_ty_22 = 15;
pub const LINUX_IFLA_VXLAN_GROUP6: linux__bindgen_ty_22 = 16;
pub const LINUX_IFLA_VXLAN_LOCAL6: linux__bindgen_ty_22 = 17;
pub const LINUX_IFLA_VXLAN_UDP_CSUM: linux__bindgen_ty_22 = 18;
pub const LINUX_IFLA_VXLAN_UDP_ZERO_CSUM6_TX: linux__bindgen_ty_22 = 19;
pub const LINUX_IFLA_VXLAN_UDP_ZERO_CSUM6_RX: linux__bindgen_ty_22 = 20;
pub const LINUX_IFLA_VXLAN_REMCSUM_TX: linux__bindgen_ty_22 = 21;
pub const LINUX_IFLA_VXLAN_REMCSUM_RX: linux__bindgen_ty_22 = 22;
pub const LINUX_IFLA_VXLAN_GBP: linux__bindgen_ty_22 = 23;
pub const LINUX_IFLA_VXLAN_REMCSUM_NOPARTIAL: linux__bindgen_ty_22 = 24;
pub const LINUX_IFLA_VXLAN_COLLECT_METADATA: linux__bindgen_ty_22 = 25;
pub const LINUX_IFLA_VXLAN_LABEL: linux__bindgen_ty_22 = 26;
pub const LINUX_IFLA_VXLAN_GPE: linux__bindgen_ty_22 = 27;
pub const LINUX_IFLA_VXLAN_TTL_INHERIT: linux__bindgen_ty_22 = 28;
pub const LINUX_IFLA_VXLAN_DF: linux__bindgen_ty_22 = 29;
pub const LINUX_IFLA_VXLAN_VNIFILTER: linux__bindgen_ty_22 = 30;
pub const LINUX___IFLA_VXLAN_MAX: linux__bindgen_ty_22 = 31;
pub type linux__bindgen_ty_22 = ::core::ffi::c_uint;
pub const LINUX_IFLA_GENEVE_UNSPEC: linux__bindgen_ty_23 = 0;
pub const LINUX_IFLA_GENEVE_ID: linux__bindgen_ty_23 = 1;
pub const LINUX_IFLA_GENEVE_REMOTE: linux__bindgen_ty_23 = 2;
pub const LINUX_IFLA_GENEVE_TTL: linux__bindgen_ty_23 = 3;
pub const LINUX_IFLA_GENEVE_TOS: linux__bindgen_ty_23 = 4;
pub const LINUX_IFLA_GENEVE_PORT: linux__bindgen_ty_23 = 5;
pub const LINUX_IFLA_GENEVE_COLLECT_METADATA: linux__bindgen_ty_23 = 6;
pub const LINUX_IFLA_GENEVE_REMOTE6: linux__bindgen_ty_23 = 7;
pub const LINUX_IFLA_GENEVE_UDP_CSUM: linux__bindgen_ty_23 = 8;
pub const LINUX_IFLA_GENEVE_UDP_ZERO_CSUM6_TX: linux__bindgen_ty_23 = 9;
pub const LINUX_IFLA_GENEVE_UDP_ZERO_CSUM6_RX: linux__bindgen_ty_23 = 10;
pub const LINUX_IFLA_GENEVE_LABEL: linux__bindgen_ty_23 = 11;
pub const LINUX_IFLA_GENEVE_TTL_INHERIT: linux__bindgen_ty_23 = 12;
pub const LINUX_IFLA_GENEVE_DF: linux__bindgen_ty_23 = 13;
pub const LINUX_IFLA_GENEVE_INNER_PROTO_INHERIT: linux__bindgen_ty_23 = 14;
pub const LINUX___IFLA_GENEVE_MAX: linux__bindgen_ty_23 = 15;
pub type linux__bindgen_ty_23 = ::core::ffi::c_uint;
pub const LINUX_IFLA_BAREUDP_UNSPEC: linux__bindgen_ty_24 = 0;
pub const LINUX_IFLA_BAREUDP_PORT: linux__bindgen_ty_24 = 1;
pub const LINUX_IFLA_BAREUDP_ETHERTYPE: linux__bindgen_ty_24 = 2;
pub const LINUX_IFLA_BAREUDP_SRCPORT_MIN: linux__bindgen_ty_24 = 3;
pub const LINUX_IFLA_BAREUDP_MULTIPROTO_MODE: linux__bindgen_ty_24 = 4;
pub const LINUX___IFLA_BAREUDP_MAX: linux__bindgen_ty_24 = 5;
pub type linux__bindgen_ty_24 = ::core::ffi::c_uint;
pub const LINUX_IFLA_PPP_UNSPEC: linux__bindgen_ty_25 = 0;
pub const LINUX_IFLA_PPP_DEV_FD: linux__bindgen_ty_25 = 1;
pub const LINUX___IFLA_PPP_MAX: linux__bindgen_ty_25 = 2;
pub type linux__bindgen_ty_25 = ::core::ffi::c_uint;
pub const LINUX_IFLA_GTP_UNSPEC: linux__bindgen_ty_26 = 0;
pub const LINUX_IFLA_GTP_FD0: linux__bindgen_ty_26 = 1;
pub const LINUX_IFLA_GTP_FD1: linux__bindgen_ty_26 = 2;
pub const LINUX_IFLA_GTP_PDP_HASHSIZE: linux__bindgen_ty_26 = 3;
pub const LINUX_IFLA_GTP_ROLE: linux__bindgen_ty_26 = 4;
pub const LINUX_IFLA_GTP_CREATE_SOCKETS: linux__bindgen_ty_26 = 5;
pub const LINUX_IFLA_GTP_RESTART_COUNT: linux__bindgen_ty_26 = 6;
pub const LINUX___IFLA_GTP_MAX: linux__bindgen_ty_26 = 7;
pub type linux__bindgen_ty_26 = ::core::ffi::c_uint;
pub const LINUX_IFLA_BOND_UNSPEC: linux__bindgen_ty_27 = 0;
pub const LINUX_IFLA_BOND_MODE: linux__bindgen_ty_27 = 1;
pub const LINUX_IFLA_BOND_ACTIVE_SLAVE: linux__bindgen_ty_27 = 2;
pub const LINUX_IFLA_BOND_MIIMON: linux__bindgen_ty_27 = 3;
pub const LINUX_IFLA_BOND_UPDELAY: linux__bindgen_ty_27 = 4;
pub const LINUX_IFLA_BOND_DOWNDELAY: linux__bindgen_ty_27 = 5;
pub const LINUX_IFLA_BOND_USE_CARRIER: linux__bindgen_ty_27 = 6;
pub const LINUX_IFLA_BOND_ARP_INTERVAL: linux__bindgen_ty_27 = 7;
pub const LINUX_IFLA_BOND_ARP_IP_TARGET: linux__bindgen_ty_27 = 8;
pub const LINUX_IFLA_BOND_ARP_VALIDATE: linux__bindgen_ty_27 = 9;
pub const LINUX_IFLA_BOND_ARP_ALL_TARGETS: linux__bindgen_ty_27 = 10;
pub const LINUX_IFLA_BOND_PRIMARY: linux__bindgen_ty_27 = 11;
pub const LINUX_IFLA_BOND_PRIMARY_RESELECT: linux__bindgen_ty_27 = 12;
pub const LINUX_IFLA_BOND_FAIL_OVER_MAC: linux__bindgen_ty_27 = 13;
pub const LINUX_IFLA_BOND_XMIT_HASH_POLICY: linux__bindgen_ty_27 = 14;
pub const LINUX_IFLA_BOND_RESEND_IGMP: linux__bindgen_ty_27 = 15;
pub const LINUX_IFLA_BOND_NUM_PEER_NOTIF: linux__bindgen_ty_27 = 16;
pub const LINUX_IFLA_BOND_ALL_SLAVES_ACTIVE: linux__bindgen_ty_27 = 17;
pub const LINUX_IFLA_BOND_MIN_LINKS: linux__bindgen_ty_27 = 18;
pub const LINUX_IFLA_BOND_LP_INTERVAL: linux__bindgen_ty_27 = 19;
pub const LINUX_IFLA_BOND_PACKETS_PER_SLAVE: linux__bindgen_ty_27 = 20;
pub const LINUX_IFLA_BOND_AD_LACP_RATE: linux__bindgen_ty_27 = 21;
pub const LINUX_IFLA_BOND_AD_SELECT: linux__bindgen_ty_27 = 22;
pub const LINUX_IFLA_BOND_AD_INFO: linux__bindgen_ty_27 = 23;
pub const LINUX_IFLA_BOND_AD_ACTOR_SYS_PRIO: linux__bindgen_ty_27 = 24;
pub const LINUX_IFLA_BOND_AD_USER_PORT_KEY: linux__bindgen_ty_27 = 25;
pub const LINUX_IFLA_BOND_AD_ACTOR_SYSTEM: linux__bindgen_ty_27 = 26;
pub const LINUX_IFLA_BOND_TLB_DYNAMIC_LB: linux__bindgen_ty_27 = 27;
pub const LINUX_IFLA_BOND_PEER_NOTIF_DELAY: linux__bindgen_ty_27 = 28;
pub const LINUX_IFLA_BOND_AD_LACP_ACTIVE: linux__bindgen_ty_27 = 29;
pub const LINUX_IFLA_BOND_MISSED_MAX: linux__bindgen_ty_27 = 30;
pub const LINUX_IFLA_BOND_NS_IP6_TARGET: linux__bindgen_ty_27 = 31;
pub const LINUX___IFLA_BOND_MAX: linux__bindgen_ty_27 = 32;
pub type linux__bindgen_ty_27 = ::core::ffi::c_uint;
pub const LINUX_IFLA_BOND_AD_INFO_UNSPEC: linux__bindgen_ty_28 = 0;
pub const LINUX_IFLA_BOND_AD_INFO_AGGREGATOR: linux__bindgen_ty_28 = 1;
pub const LINUX_IFLA_BOND_AD_INFO_NUM_PORTS: linux__bindgen_ty_28 = 2;
pub const LINUX_IFLA_BOND_AD_INFO_ACTOR_KEY: linux__bindgen_ty_28 = 3;
pub const LINUX_IFLA_BOND_AD_INFO_PARTNER_KEY: linux__bindgen_ty_28 = 4;
pub const LINUX_IFLA_BOND_AD_INFO_PARTNER_MAC: linux__bindgen_ty_28 = 5;
pub const LINUX___IFLA_BOND_AD_INFO_MAX: linux__bindgen_ty_28 = 6;
pub type linux__bindgen_ty_28 = ::core::ffi::c_uint;
pub const LINUX_IFLA_BOND_SLAVE_UNSPEC: linux__bindgen_ty_29 = 0;
pub const LINUX_IFLA_BOND_SLAVE_STATE: linux__bindgen_ty_29 = 1;
pub const LINUX_IFLA_BOND_SLAVE_MII_STATUS: linux__bindgen_ty_29 = 2;
pub const LINUX_IFLA_BOND_SLAVE_LINK_FAILURE_COUNT: linux__bindgen_ty_29 = 3;
pub const LINUX_IFLA_BOND_SLAVE_PERM_HWADDR: linux__bindgen_ty_29 = 4;
pub const LINUX_IFLA_BOND_SLAVE_QUEUE_ID: linux__bindgen_ty_29 = 5;
pub const LINUX_IFLA_BOND_SLAVE_AD_AGGREGATOR_ID: linux__bindgen_ty_29 = 6;
pub const LINUX_IFLA_BOND_SLAVE_AD_ACTOR_OPER_PORT_STATE: linux__bindgen_ty_29 = 7;
pub const LINUX_IFLA_BOND_SLAVE_AD_PARTNER_OPER_PORT_STATE: linux__bindgen_ty_29 = 8;
pub const LINUX_IFLA_BOND_SLAVE_PRIO: linux__bindgen_ty_29 = 9;
pub const LINUX___IFLA_BOND_SLAVE_MAX: linux__bindgen_ty_29 = 10;
pub type linux__bindgen_ty_29 = ::core::ffi::c_uint;
pub const LINUX_IFLA_VF_INFO_UNSPEC: linux__bindgen_ty_30 = 0;
pub const LINUX_IFLA_VF_INFO: linux__bindgen_ty_30 = 1;
pub const LINUX___IFLA_VF_INFO_MAX: linux__bindgen_ty_30 = 2;
pub type linux__bindgen_ty_30 = ::core::ffi::c_uint;
pub const LINUX_IFLA_VF_UNSPEC: linux__bindgen_ty_31 = 0;
pub const LINUX_IFLA_VF_MAC: linux__bindgen_ty_31 = 1;
pub const LINUX_IFLA_VF_VLAN: linux__bindgen_ty_31 = 2;
pub const LINUX_IFLA_VF_TX_RATE: linux__bindgen_ty_31 = 3;
pub const LINUX_IFLA_VF_SPOOFCHK: linux__bindgen_ty_31 = 4;
pub const LINUX_IFLA_VF_LINK_STATE: linux__bindgen_ty_31 = 5;
pub const LINUX_IFLA_VF_RATE: linux__bindgen_ty_31 = 6;
pub const LINUX_IFLA_VF_RSS_QUERY_EN: linux__bindgen_ty_31 = 7;
pub const LINUX_IFLA_VF_STATS: linux__bindgen_ty_31 = 8;
pub const LINUX_IFLA_VF_TRUST: linux__bindgen_ty_31 = 9;
pub const LINUX_IFLA_VF_IB_NODE_GUID: linux__bindgen_ty_31 = 10;
pub const LINUX_IFLA_VF_IB_PORT_GUID: linux__bindgen_ty_31 = 11;
pub const LINUX_IFLA_VF_VLAN_LIST: linux__bindgen_ty_31 = 12;
pub const LINUX_IFLA_VF_BROADCAST: linux__bindgen_ty_31 = 13;
pub const LINUX___IFLA_VF_MAX: linux__bindgen_ty_31 = 14;
pub type linux__bindgen_ty_31 = ::core::ffi::c_uint;
pub const LINUX_IFLA_VF_VLAN_INFO_UNSPEC: linux__bindgen_ty_32 = 0;
pub const LINUX_IFLA_VF_VLAN_INFO: linux__bindgen_ty_32 = 1;
pub const LINUX___IFLA_VF_VLAN_INFO_MAX: linux__bindgen_ty_32 = 2;
pub type linux__bindgen_ty_32 = ::core::ffi::c_uint;
pub const LINUX_IFLA_VF_LINK_STATE_AUTO: linux__bindgen_ty_33 = 0;
pub const LINUX_IFLA_VF_LINK_STATE_ENABLE: linux__bindgen_ty_33 = 1;
pub const LINUX_IFLA_VF_LINK_STATE_DISABLE: linux__bindgen_ty_33 = 2;
pub const LINUX___IFLA_VF_LINK_STATE_MAX: linux__bindgen_ty_33 = 3;
pub type linux__bindgen_ty_33 = ::core::ffi::c_uint;
pub const LINUX_IFLA_VF_STATS_RX_PACKETS: linux__bindgen_ty_34 = 0;
pub const LINUX_IFLA_VF_STATS_TX_PACKETS: linux__bindgen_ty_34 = 1;
pub const LINUX_IFLA_VF_STATS_RX_BYTES: linux__bindgen_ty_34 = 2;
pub const LINUX_IFLA_VF_STATS_TX_BYTES: linux__bindgen_ty_34 = 3;
pub const LINUX_IFLA_VF_STATS_BROADCAST: linux__bindgen_ty_34 = 4;
pub const LINUX_IFLA_VF_STATS_MULTICAST: linux__bindgen_ty_34 = 5;
pub const LINUX_IFLA_VF_STATS_PAD: linux__bindgen_ty_34 = 6;
pub const LINUX_IFLA_VF_STATS_RX_DROPPED: linux__bindgen_ty_34 = 7;
pub const LINUX_IFLA_VF_STATS_TX_DROPPED: linux__bindgen_ty_34 = 8;
pub const LINUX___IFLA_VF_STATS_MAX: linux__bindgen_ty_34 = 9;
pub type linux__bindgen_ty_34 = ::core::ffi::c_uint;
pub const LINUX_IFLA_VF_PORT_UNSPEC: linux__bindgen_ty_35 = 0;
pub const LINUX_IFLA_VF_PORT: linux__bindgen_ty_35 = 1;
pub const LINUX___IFLA_VF_PORT_MAX: linux__bindgen_ty_35 = 2;
pub type linux__bindgen_ty_35 = ::core::ffi::c_uint;
pub const LINUX_IFLA_PORT_UNSPEC: linux__bindgen_ty_36 = 0;
pub const LINUX_IFLA_PORT_VF: linux__bindgen_ty_36 = 1;
pub const LINUX_IFLA_PORT_PROFILE: linux__bindgen_ty_36 = 2;
pub const LINUX_IFLA_PORT_VSI_TYPE: linux__bindgen_ty_36 = 3;
pub const LINUX_IFLA_PORT_INSTANCE_UUID: linux__bindgen_ty_36 = 4;
pub const LINUX_IFLA_PORT_HOST_UUID: linux__bindgen_ty_36 = 5;
pub const LINUX_IFLA_PORT_REQUEST: linux__bindgen_ty_36 = 6;
pub const LINUX_IFLA_PORT_RESPONSE: linux__bindgen_ty_36 = 7;
pub const LINUX___IFLA_PORT_MAX: linux__bindgen_ty_36 = 8;
pub type linux__bindgen_ty_36 = ::core::ffi::c_uint;
pub const LINUX_PORT_REQUEST_PREASSOCIATE: linux__bindgen_ty_37 = 0;
pub const LINUX_PORT_REQUEST_PREASSOCIATE_RR: linux__bindgen_ty_37 = 1;
pub const LINUX_PORT_REQUEST_ASSOCIATE: linux__bindgen_ty_37 = 2;
pub const LINUX_PORT_REQUEST_DISASSOCIATE: linux__bindgen_ty_37 = 3;
pub type linux__bindgen_ty_37 = ::core::ffi::c_uint;
pub const LINUX_PORT_VDP_RESPONSE_SUCCESS: linux__bindgen_ty_38 = 0;
pub const LINUX_PORT_VDP_RESPONSE_INVALID_FORMAT: linux__bindgen_ty_38 = 1;
pub const LINUX_PORT_VDP_RESPONSE_INSUFFICIENT_RESOURCES: linux__bindgen_ty_38 = 2;
pub const LINUX_PORT_VDP_RESPONSE_UNUSED_VTID: linux__bindgen_ty_38 = 3;
pub const LINUX_PORT_VDP_RESPONSE_VTID_VIOLATION: linux__bindgen_ty_38 = 4;
pub const LINUX_PORT_VDP_RESPONSE_VTID_VERSION_VIOALTION: linux__bindgen_ty_38 = 5;
pub const LINUX_PORT_VDP_RESPONSE_OUT_OF_SYNC: linux__bindgen_ty_38 = 6;
pub const LINUX_PORT_PROFILE_RESPONSE_SUCCESS: linux__bindgen_ty_38 = 256;
pub const LINUX_PORT_PROFILE_RESPONSE_INPROGRESS: linux__bindgen_ty_38 = 257;
pub const LINUX_PORT_PROFILE_RESPONSE_INVALID: linux__bindgen_ty_38 = 258;
pub const LINUX_PORT_PROFILE_RESPONSE_BADSTATE: linux__bindgen_ty_38 = 259;
pub const LINUX_PORT_PROFILE_RESPONSE_INSUFFICIENT_RESOURCES: linux__bindgen_ty_38 = 260;
pub const LINUX_PORT_PROFILE_RESPONSE_ERROR: linux__bindgen_ty_38 = 261;
pub type linux__bindgen_ty_38 = ::core::ffi::c_uint;
pub const LINUX_IFLA_IPOIB_UNSPEC: linux__bindgen_ty_39 = 0;
pub const LINUX_IFLA_IPOIB_PKEY: linux__bindgen_ty_39 = 1;
pub const LINUX_IFLA_IPOIB_MODE: linux__bindgen_ty_39 = 2;
pub const LINUX_IFLA_IPOIB_UMCAST: linux__bindgen_ty_39 = 3;
pub const LINUX___IFLA_IPOIB_MAX: linux__bindgen_ty_39 = 4;
pub type linux__bindgen_ty_39 = ::core::ffi::c_uint;
pub const LINUX_IPOIB_MODE_DATAGRAM: linux__bindgen_ty_40 = 0;
pub const LINUX_IPOIB_MODE_CONNECTED: linux__bindgen_ty_40 = 1;
pub type linux__bindgen_ty_40 = ::core::ffi::c_uint;
pub const LINUX_HSR_PROTOCOL_HSR: linux__bindgen_ty_41 = 0;
pub const LINUX_HSR_PROTOCOL_PRP: linux__bindgen_ty_41 = 1;
pub const LINUX_HSR_PROTOCOL_MAX: linux__bindgen_ty_41 = 2;
pub type linux__bindgen_ty_41 = ::core::ffi::c_uint;
pub const LINUX_IFLA_HSR_UNSPEC: linux__bindgen_ty_42 = 0;
pub const LINUX_IFLA_HSR_SLAVE1: linux__bindgen_ty_42 = 1;
pub const LINUX_IFLA_HSR_SLAVE2: linux__bindgen_ty_42 = 2;
pub const LINUX_IFLA_HSR_MULTICAST_SPEC: linux__bindgen_ty_42 = 3;
pub const LINUX_IFLA_HSR_SUPERVISION_ADDR: linux__bindgen_ty_42 = 4;
pub const LINUX_IFLA_HSR_SEQ_NR: linux__bindgen_ty_42 = 5;
pub const LINUX_IFLA_HSR_VERSION: linux__bindgen_ty_42 = 6;
pub const LINUX_IFLA_HSR_PROTOCOL: linux__bindgen_ty_42 = 7;
pub const LINUX___IFLA_HSR_MAX: linux__bindgen_ty_42 = 8;
pub type linux__bindgen_ty_42 = ::core::ffi::c_uint;
pub const LINUX_IFLA_STATS_UNSPEC: linux__bindgen_ty_43 = 0;
pub const LINUX_IFLA_STATS_LINK_64: linux__bindgen_ty_43 = 1;
pub const LINUX_IFLA_STATS_LINK_XSTATS: linux__bindgen_ty_43 = 2;
pub const LINUX_IFLA_STATS_LINK_XSTATS_SLAVE: linux__bindgen_ty_43 = 3;
pub const LINUX_IFLA_STATS_LINK_OFFLOAD_XSTATS: linux__bindgen_ty_43 = 4;
pub const LINUX_IFLA_STATS_AF_SPEC: linux__bindgen_ty_43 = 5;
pub const LINUX___IFLA_STATS_MAX: linux__bindgen_ty_43 = 6;
pub type linux__bindgen_ty_43 = ::core::ffi::c_uint;
pub const LINUX_IFLA_STATS_GETSET_UNSPEC: linux__bindgen_ty_44 = 0;
pub const LINUX_IFLA_STATS_GET_FILTERS: linux__bindgen_ty_44 = 1;
pub const LINUX_IFLA_STATS_SET_OFFLOAD_XSTATS_L3_STATS: linux__bindgen_ty_44 = 2;
pub const LINUX___IFLA_STATS_GETSET_MAX: linux__bindgen_ty_44 = 3;
pub type linux__bindgen_ty_44 = ::core::ffi::c_uint;
pub const LINUX_LINK_XSTATS_TYPE_UNSPEC: linux__bindgen_ty_45 = 0;
pub const LINUX_LINK_XSTATS_TYPE_BRIDGE: linux__bindgen_ty_45 = 1;
pub const LINUX_LINK_XSTATS_TYPE_BOND: linux__bindgen_ty_45 = 2;
pub const LINUX___LINK_XSTATS_TYPE_MAX: linux__bindgen_ty_45 = 3;
pub type linux__bindgen_ty_45 = ::core::ffi::c_uint;
pub const LINUX_IFLA_OFFLOAD_XSTATS_UNSPEC: linux__bindgen_ty_46 = 0;
pub const LINUX_IFLA_OFFLOAD_XSTATS_CPU_HIT: linux__bindgen_ty_46 = 1;
pub const LINUX_IFLA_OFFLOAD_XSTATS_HW_S_INFO: linux__bindgen_ty_46 = 2;
pub const LINUX_IFLA_OFFLOAD_XSTATS_L3_STATS: linux__bindgen_ty_46 = 3;
pub const LINUX___IFLA_OFFLOAD_XSTATS_MAX: linux__bindgen_ty_46 = 4;
pub type linux__bindgen_ty_46 = ::core::ffi::c_uint;
pub const LINUX_IFLA_OFFLOAD_XSTATS_HW_S_INFO_UNSPEC: linux__bindgen_ty_47 = 0;
pub const LINUX_IFLA_OFFLOAD_XSTATS_HW_S_INFO_REQUEST: linux__bindgen_ty_47 = 1;
pub const LINUX_IFLA_OFFLOAD_XSTATS_HW_S_INFO_USED: linux__bindgen_ty_47 = 2;
pub const LINUX___IFLA_OFFLOAD_XSTATS_HW_S_INFO_MAX: linux__bindgen_ty_47 = 3;
pub type linux__bindgen_ty_47 = ::core::ffi::c_uint;
pub const LINUX_XDP_ATTACHED_NONE: linux__bindgen_ty_48 = 0;
pub const LINUX_XDP_ATTACHED_DRV: linux__bindgen_ty_48 = 1;
pub const LINUX_XDP_ATTACHED_SKB: linux__bindgen_ty_48 = 2;
pub const LINUX_XDP_ATTACHED_HW: linux__bindgen_ty_48 = 3;
pub const LINUX_XDP_ATTACHED_MULTI: linux__bindgen_ty_48 = 4;
pub type linux__bindgen_ty_48 = ::core::ffi::c_uint;
pub const LINUX_IFLA_XDP_UNSPEC: linux__bindgen_ty_49 = 0;
pub const LINUX_IFLA_XDP_FD: linux__bindgen_ty_49 = 1;
pub const LINUX_IFLA_XDP_ATTACHED: linux__bindgen_ty_49 = 2;
pub const LINUX_IFLA_XDP_FLAGS: linux__bindgen_ty_49 = 3;
pub const LINUX_IFLA_XDP_PROG_ID: linux__bindgen_ty_49 = 4;
pub const LINUX_IFLA_XDP_DRV_PROG_ID: linux__bindgen_ty_49 = 5;
pub const LINUX_IFLA_XDP_SKB_PROG_ID: linux__bindgen_ty_49 = 6;
pub const LINUX_IFLA_XDP_HW_PROG_ID: linux__bindgen_ty_49 = 7;
pub const LINUX_IFLA_XDP_EXPECTED_FD: linux__bindgen_ty_49 = 8;
pub const LINUX___IFLA_XDP_MAX: linux__bindgen_ty_49 = 9;
pub type linux__bindgen_ty_49 = ::core::ffi::c_uint;
pub const LINUX_IFLA_EVENT_NONE: linux__bindgen_ty_50 = 0;
pub const LINUX_IFLA_EVENT_REBOOT: linux__bindgen_ty_50 = 1;
pub const LINUX_IFLA_EVENT_FEATURES: linux__bindgen_ty_50 = 2;
pub const LINUX_IFLA_EVENT_BONDING_FAILOVER: linux__bindgen_ty_50 = 3;
pub const LINUX_IFLA_EVENT_NOTIFY_PEERS: linux__bindgen_ty_50 = 4;
pub const LINUX_IFLA_EVENT_IGMP_RESEND: linux__bindgen_ty_50 = 5;
pub const LINUX_IFLA_EVENT_BONDING_OPTIONS: linux__bindgen_ty_50 = 6;
pub type linux__bindgen_ty_50 = ::core::ffi::c_uint;
pub const LINUX_IFLA_TUN_UNSPEC: linux__bindgen_ty_51 = 0;
pub const LINUX_IFLA_TUN_OWNER: linux__bindgen_ty_51 = 1;
pub const LINUX_IFLA_TUN_GROUP: linux__bindgen_ty_51 = 2;
pub const LINUX_IFLA_TUN_TYPE: linux__bindgen_ty_51 = 3;
pub const LINUX_IFLA_TUN_PI: linux__bindgen_ty_51 = 4;
pub const LINUX_IFLA_TUN_VNET_HDR: linux__bindgen_ty_51 = 5;
pub const LINUX_IFLA_TUN_PERSIST: linux__bindgen_ty_51 = 6;
pub const LINUX_IFLA_TUN_MULTI_QUEUE: linux__bindgen_ty_51 = 7;
pub const LINUX_IFLA_TUN_NUM_QUEUES: linux__bindgen_ty_51 = 8;
pub const LINUX_IFLA_TUN_NUM_DISABLED_QUEUES: linux__bindgen_ty_51 = 9;
pub const LINUX___IFLA_TUN_MAX: linux__bindgen_ty_51 = 10;
pub type linux__bindgen_ty_51 = ::core::ffi::c_uint;
pub const LINUX_IFLA_RMNET_UNSPEC: linux__bindgen_ty_52 = 0;
pub const LINUX_IFLA_RMNET_MUX_ID: linux__bindgen_ty_52 = 1;
pub const LINUX_IFLA_RMNET_FLAGS: linux__bindgen_ty_52 = 2;
pub const LINUX___IFLA_RMNET_MAX: linux__bindgen_ty_52 = 3;
pub type linux__bindgen_ty_52 = ::core::ffi::c_uint;
pub const LINUX_IFLA_MCTP_UNSPEC: linux__bindgen_ty_53 = 0;
pub const LINUX_IFLA_MCTP_NET: linux__bindgen_ty_53 = 1;
pub const LINUX___IFLA_MCTP_MAX: linux__bindgen_ty_53 = 2;
pub type linux__bindgen_ty_53 = ::core::ffi::c_uint;
pub const LINUX_IFLA_DSA_UNSPEC: linux__bindgen_ty_54 = 0;
pub const LINUX_IFLA_DSA_MASTER: linux__bindgen_ty_54 = 1;
pub const LINUX___IFLA_DSA_MAX: linux__bindgen_ty_54 = 2;
pub type linux__bindgen_ty_54 = ::core::ffi::c_uint;
pub const LINUX_IFA_UNSPEC: linux__bindgen_ty_55 = 0;
pub const LINUX_IFA_ADDRESS: linux__bindgen_ty_55 = 1;
pub const LINUX_IFA_LOCAL: linux__bindgen_ty_55 = 2;
pub const LINUX_IFA_LABEL: linux__bindgen_ty_55 = 3;
pub const LINUX_IFA_BROADCAST: linux__bindgen_ty_55 = 4;
pub const LINUX_IFA_ANYCAST: linux__bindgen_ty_55 = 5;
pub const LINUX_IFA_CACHEINFO: linux__bindgen_ty_55 = 6;
pub const LINUX_IFA_MULTICAST: linux__bindgen_ty_55 = 7;
pub const LINUX_IFA_FLAGS: linux__bindgen_ty_55 = 8;
pub const LINUX_IFA_RT_PRIORITY: linux__bindgen_ty_55 = 9;
pub const LINUX_IFA_TARGET_NETNSID: linux__bindgen_ty_55 = 10;
pub const LINUX_IFA_PROTO: linux__bindgen_ty_55 = 11;
pub const LINUX___IFA_MAX: linux__bindgen_ty_55 = 12;
pub type linux__bindgen_ty_55 = ::core::ffi::c_uint;
pub const LINUX_NDA_UNSPEC: linux__bindgen_ty_56 = 0;
pub const LINUX_NDA_DST: linux__bindgen_ty_56 = 1;
pub const LINUX_NDA_LLADDR: linux__bindgen_ty_56 = 2;
pub const LINUX_NDA_CACHEINFO: linux__bindgen_ty_56 = 3;
pub const LINUX_NDA_PROBES: linux__bindgen_ty_56 = 4;
pub const LINUX_NDA_VLAN: linux__bindgen_ty_56 = 5;
pub const LINUX_NDA_PORT: linux__bindgen_ty_56 = 6;
pub const LINUX_NDA_VNI: linux__bindgen_ty_56 = 7;
pub const LINUX_NDA_IFINDEX: linux__bindgen_ty_56 = 8;
pub const LINUX_NDA_MASTER: linux__bindgen_ty_56 = 9;
pub const LINUX_NDA_LINK_NETNSID: linux__bindgen_ty_56 = 10;
pub const LINUX_NDA_SRC_VNI: linux__bindgen_ty_56 = 11;
pub const LINUX_NDA_PROTOCOL: linux__bindgen_ty_56 = 12;
pub const LINUX_NDA_NH_ID: linux__bindgen_ty_56 = 13;
pub const LINUX_NDA_FDB_EXT_ATTRS: linux__bindgen_ty_56 = 14;
pub const LINUX_NDA_FLAGS_EXT: linux__bindgen_ty_56 = 15;
pub const LINUX_NDA_NDM_STATE_MASK: linux__bindgen_ty_56 = 16;
pub const LINUX_NDA_NDM_FLAGS_MASK: linux__bindgen_ty_56 = 17;
pub const LINUX___NDA_MAX: linux__bindgen_ty_56 = 18;
pub type linux__bindgen_ty_56 = ::core::ffi::c_uint;
pub const LINUX_NDTPA_UNSPEC: linux__bindgen_ty_57 = 0;
pub const LINUX_NDTPA_IFINDEX: linux__bindgen_ty_57 = 1;
pub const LINUX_NDTPA_REFCNT: linux__bindgen_ty_57 = 2;
pub const LINUX_NDTPA_REACHABLE_TIME: linux__bindgen_ty_57 = 3;
pub const LINUX_NDTPA_BASE_REACHABLE_TIME: linux__bindgen_ty_57 = 4;
pub const LINUX_NDTPA_RETRANS_TIME: linux__bindgen_ty_57 = 5;
pub const LINUX_NDTPA_GC_STALETIME: linux__bindgen_ty_57 = 6;
pub const LINUX_NDTPA_DELAY_PROBE_TIME: linux__bindgen_ty_57 = 7;
pub const LINUX_NDTPA_QUEUE_LEN: linux__bindgen_ty_57 = 8;
pub const LINUX_NDTPA_APP_PROBES: linux__bindgen_ty_57 = 9;
pub const LINUX_NDTPA_UCAST_PROBES: linux__bindgen_ty_57 = 10;
pub const LINUX_NDTPA_MCAST_PROBES: linux__bindgen_ty_57 = 11;
pub const LINUX_NDTPA_ANYCAST_DELAY: linux__bindgen_ty_57 = 12;
pub const LINUX_NDTPA_PROXY_DELAY: linux__bindgen_ty_57 = 13;
pub const LINUX_NDTPA_PROXY_QLEN: linux__bindgen_ty_57 = 14;
pub const LINUX_NDTPA_LOCKTIME: linux__bindgen_ty_57 = 15;
pub const LINUX_NDTPA_QUEUE_LENBYTES: linux__bindgen_ty_57 = 16;
pub const LINUX_NDTPA_MCAST_REPROBES: linux__bindgen_ty_57 = 17;
pub const LINUX_NDTPA_PAD: linux__bindgen_ty_57 = 18;
pub const LINUX_NDTPA_INTERVAL_PROBE_TIME_MS: linux__bindgen_ty_57 = 19;
pub const LINUX___NDTPA_MAX: linux__bindgen_ty_57 = 20;
pub type linux__bindgen_ty_57 = ::core::ffi::c_uint;
pub const LINUX_NDTA_UNSPEC: linux__bindgen_ty_58 = 0;
pub const LINUX_NDTA_NAME: linux__bindgen_ty_58 = 1;
pub const LINUX_NDTA_THRESH1: linux__bindgen_ty_58 = 2;
pub const LINUX_NDTA_THRESH2: linux__bindgen_ty_58 = 3;
pub const LINUX_NDTA_THRESH3: linux__bindgen_ty_58 = 4;
pub const LINUX_NDTA_CONFIG: linux__bindgen_ty_58 = 5;
pub const LINUX_NDTA_PARMS: linux__bindgen_ty_58 = 6;
pub const LINUX_NDTA_STATS: linux__bindgen_ty_58 = 7;
pub const LINUX_NDTA_GC_INTERVAL: linux__bindgen_ty_58 = 8;
pub const LINUX_NDTA_PAD: linux__bindgen_ty_58 = 9;
pub const LINUX___NDTA_MAX: linux__bindgen_ty_58 = 10;
pub type linux__bindgen_ty_58 = ::core::ffi::c_uint;
pub const LINUX_FDB_NOTIFY_BIT: linux__bindgen_ty_59 = 1;
pub const LINUX_FDB_NOTIFY_INACTIVE_BIT: linux__bindgen_ty_59 = 2;
pub type linux__bindgen_ty_59 = ::core::ffi::c_uint;
pub const LINUX_NFEA_UNSPEC: linux__bindgen_ty_60 = 0;
pub const LINUX_NFEA_ACTIVITY_NOTIFY: linux__bindgen_ty_60 = 1;
pub const LINUX_NFEA_DONT_REFRESH: linux__bindgen_ty_60 = 2;
pub const LINUX___NFEA_MAX: linux__bindgen_ty_60 = 3;
pub type linux__bindgen_ty_60 = ::core::ffi::c_uint;
pub const LINUX_RTM_BASE: linux__bindgen_ty_61 = 16;
pub const LINUX_RTM_NEWLINK: linux__bindgen_ty_61 = 16;
pub const LINUX_RTM_DELLINK: linux__bindgen_ty_61 = 17;
pub const LINUX_RTM_GETLINK: linux__bindgen_ty_61 = 18;
pub const LINUX_RTM_SETLINK: linux__bindgen_ty_61 = 19;
pub const LINUX_RTM_NEWADDR: linux__bindgen_ty_61 = 20;
pub const LINUX_RTM_DELADDR: linux__bindgen_ty_61 = 21;
pub const LINUX_RTM_GETADDR: linux__bindgen_ty_61 = 22;
pub const LINUX_RTM_NEWROUTE: linux__bindgen_ty_61 = 24;
pub const LINUX_RTM_DELROUTE: linux__bindgen_ty_61 = 25;
pub const LINUX_RTM_GETROUTE: linux__bindgen_ty_61 = 26;
pub const LINUX_RTM_NEWNEIGH: linux__bindgen_ty_61 = 28;
pub const LINUX_RTM_DELNEIGH: linux__bindgen_ty_61 = 29;
pub const LINUX_RTM_GETNEIGH: linux__bindgen_ty_61 = 30;
pub const LINUX_RTM_NEWRULE: linux__bindgen_ty_61 = 32;
pub const LINUX_RTM_DELRULE: linux__bindgen_ty_61 = 33;
pub const LINUX_RTM_GETRULE: linux__bindgen_ty_61 = 34;
pub const LINUX_RTM_NEWQDISC: linux__bindgen_ty_61 = 36;
pub const LINUX_RTM_DELQDISC: linux__bindgen_ty_61 = 37;
pub const LINUX_RTM_GETQDISC: linux__bindgen_ty_61 = 38;
pub const LINUX_RTM_NEWTCLASS: linux__bindgen_ty_61 = 40;
pub const LINUX_RTM_DELTCLASS: linux__bindgen_ty_61 = 41;
pub const LINUX_RTM_GETTCLASS: linux__bindgen_ty_61 = 42;
pub const LINUX_RTM_NEWTFILTER: linux__bindgen_ty_61 = 44;
pub const LINUX_RTM_DELTFILTER: linux__bindgen_ty_61 = 45;
pub const LINUX_RTM_GETTFILTER: linux__bindgen_ty_61 = 46;
pub const LINUX_RTM_NEWACTION: linux__bindgen_ty_61 = 48;
pub const LINUX_RTM_DELACTION: linux__bindgen_ty_61 = 49;
pub const LINUX_RTM_GETACTION: linux__bindgen_ty_61 = 50;
pub const LINUX_RTM_NEWPREFIX: linux__bindgen_ty_61 = 52;
pub const LINUX_RTM_GETMULTICAST: linux__bindgen_ty_61 = 58;
pub const LINUX_RTM_GETANYCAST: linux__bindgen_ty_61 = 62;
pub const LINUX_RTM_NEWNEIGHTBL: linux__bindgen_ty_61 = 64;
pub const LINUX_RTM_GETNEIGHTBL: linux__bindgen_ty_61 = 66;
pub const LINUX_RTM_SETNEIGHTBL: linux__bindgen_ty_61 = 67;
pub const LINUX_RTM_NEWNDUSEROPT: linux__bindgen_ty_61 = 68;
pub const LINUX_RTM_NEWADDRLABEL: linux__bindgen_ty_61 = 72;
pub const LINUX_RTM_DELADDRLABEL: linux__bindgen_ty_61 = 73;
pub const LINUX_RTM_GETADDRLABEL: linux__bindgen_ty_61 = 74;
pub const LINUX_RTM_GETDCB: linux__bindgen_ty_61 = 78;
pub const LINUX_RTM_SETDCB: linux__bindgen_ty_61 = 79;
pub const LINUX_RTM_NEWNETCONF: linux__bindgen_ty_61 = 80;
pub const LINUX_RTM_DELNETCONF: linux__bindgen_ty_61 = 81;
pub const LINUX_RTM_GETNETCONF: linux__bindgen_ty_61 = 82;
pub const LINUX_RTM_NEWMDB: linux__bindgen_ty_61 = 84;
pub const LINUX_RTM_DELMDB: linux__bindgen_ty_61 = 85;
pub const LINUX_RTM_GETMDB: linux__bindgen_ty_61 = 86;
pub const LINUX_RTM_NEWNSID: linux__bindgen_ty_61 = 88;
pub const LINUX_RTM_DELNSID: linux__bindgen_ty_61 = 89;
pub const LINUX_RTM_GETNSID: linux__bindgen_ty_61 = 90;
pub const LINUX_RTM_NEWSTATS: linux__bindgen_ty_61 = 92;
pub const LINUX_RTM_GETSTATS: linux__bindgen_ty_61 = 94;
pub const LINUX_RTM_SETSTATS: linux__bindgen_ty_61 = 95;
pub const LINUX_RTM_NEWCACHEREPORT: linux__bindgen_ty_61 = 96;
pub const LINUX_RTM_NEWCHAIN: linux__bindgen_ty_61 = 100;
pub const LINUX_RTM_DELCHAIN: linux__bindgen_ty_61 = 101;
pub const LINUX_RTM_GETCHAIN: linux__bindgen_ty_61 = 102;
pub const LINUX_RTM_NEWNEXTHOP: linux__bindgen_ty_61 = 104;
pub const LINUX_RTM_DELNEXTHOP: linux__bindgen_ty_61 = 105;
pub const LINUX_RTM_GETNEXTHOP: linux__bindgen_ty_61 = 106;
pub const LINUX_RTM_NEWLINKPROP: linux__bindgen_ty_61 = 108;
pub const LINUX_RTM_DELLINKPROP: linux__bindgen_ty_61 = 109;
pub const LINUX_RTM_GETLINKPROP: linux__bindgen_ty_61 = 110;
pub const LINUX_RTM_NEWVLAN: linux__bindgen_ty_61 = 112;
pub const LINUX_RTM_DELVLAN: linux__bindgen_ty_61 = 113;
pub const LINUX_RTM_GETVLAN: linux__bindgen_ty_61 = 114;
pub const LINUX_RTM_NEWNEXTHOPBUCKET: linux__bindgen_ty_61 = 116;
pub const LINUX_RTM_DELNEXTHOPBUCKET: linux__bindgen_ty_61 = 117;
pub const LINUX_RTM_GETNEXTHOPBUCKET: linux__bindgen_ty_61 = 118;
pub const LINUX_RTM_NEWTUNNEL: linux__bindgen_ty_61 = 120;
pub const LINUX_RTM_DELTUNNEL: linux__bindgen_ty_61 = 121;
pub const LINUX_RTM_GETTUNNEL: linux__bindgen_ty_61 = 122;
pub const LINUX___RTM_MAX: linux__bindgen_ty_61 = 123;
#[doc = "\t\tRouting/neighbour discovery messages."]
pub type linux__bindgen_ty_61 = ::core::ffi::c_uint;
pub const LINUX_RTN_UNSPEC: linux__bindgen_ty_62 = 0;
pub const LINUX_RTN_UNICAST: linux__bindgen_ty_62 = 1;
pub const LINUX_RTN_LOCAL: linux__bindgen_ty_62 = 2;
pub const LINUX_RTN_BROADCAST: linux__bindgen_ty_62 = 3;
pub const LINUX_RTN_ANYCAST: linux__bindgen_ty_62 = 4;
pub const LINUX_RTN_MULTICAST: linux__bindgen_ty_62 = 5;
pub const LINUX_RTN_BLACKHOLE: linux__bindgen_ty_62 = 6;
pub const LINUX_RTN_UNREACHABLE: linux__bindgen_ty_62 = 7;
pub const LINUX_RTN_PROHIBIT: linux__bindgen_ty_62 = 8;
pub const LINUX_RTN_THROW: linux__bindgen_ty_62 = 9;
pub const LINUX_RTN_NAT: linux__bindgen_ty_62 = 10;
pub const LINUX_RTN_XRESOLVE: linux__bindgen_ty_62 = 11;
pub const LINUX___RTN_MAX: linux__bindgen_ty_62 = 12;
pub type linux__bindgen_ty_62 = ::core::ffi::c_uint;
pub const LINUX_RTAX_UNSPEC: linux__bindgen_ty_63 = 0;
pub const LINUX_RTAX_LOCK: linux__bindgen_ty_63 = 1;
pub const LINUX_RTAX_MTU: linux__bindgen_ty_63 = 2;
pub const LINUX_RTAX_WINDOW: linux__bindgen_ty_63 = 3;
pub const LINUX_RTAX_RTT: linux__bindgen_ty_63 = 4;
pub const LINUX_RTAX_RTTVAR: linux__bindgen_ty_63 = 5;
pub const LINUX_RTAX_SSTHRESH: linux__bindgen_ty_63 = 6;
pub const LINUX_RTAX_CWND: linux__bindgen_ty_63 = 7;
pub const LINUX_RTAX_ADVMSS: linux__bindgen_ty_63 = 8;
pub const LINUX_RTAX_REORDERING: linux__bindgen_ty_63 = 9;
pub const LINUX_RTAX_HOPLIMIT: linux__bindgen_ty_63 = 10;
pub const LINUX_RTAX_INITCWND: linux__bindgen_ty_63 = 11;
pub const LINUX_RTAX_FEATURES: linux__bindgen_ty_63 = 12;
pub const LINUX_RTAX_RTO_MIN: linux__bindgen_ty_63 = 13;
pub const LINUX_RTAX_INITRWND: linux__bindgen_ty_63 = 14;
pub const LINUX_RTAX_QUICKACK: linux__bindgen_ty_63 = 15;
pub const LINUX_RTAX_CC_ALGO: linux__bindgen_ty_63 = 16;
pub const LINUX_RTAX_FASTOPEN_NO_COOKIE: linux__bindgen_ty_63 = 17;
pub const LINUX___RTAX_MAX: linux__bindgen_ty_63 = 18;
pub type linux__bindgen_ty_63 = ::core::ffi::c_uint;
pub const LINUX_PREFIX_UNSPEC: linux__bindgen_ty_64 = 0;
pub const LINUX_PREFIX_ADDRESS: linux__bindgen_ty_64 = 1;
pub const LINUX_PREFIX_CACHEINFO: linux__bindgen_ty_64 = 2;
pub const LINUX___PREFIX_MAX: linux__bindgen_ty_64 = 3;
pub type linux__bindgen_ty_64 = ::core::ffi::c_uint;
pub const LINUX_TCA_UNSPEC: linux__bindgen_ty_65 = 0;
pub const LINUX_TCA_KIND: linux__bindgen_ty_65 = 1;
pub const LINUX_TCA_OPTIONS: linux__bindgen_ty_65 = 2;
pub const LINUX_TCA_STATS: linux__bindgen_ty_65 = 3;
pub const LINUX_TCA_XSTATS: linux__bindgen_ty_65 = 4;
pub const LINUX_TCA_RATE: linux__bindgen_ty_65 = 5;
pub const LINUX_TCA_FCNT: linux__bindgen_ty_65 = 6;
pub const LINUX_TCA_STATS2: linux__bindgen_ty_65 = 7;
pub const LINUX_TCA_STAB: linux__bindgen_ty_65 = 8;
pub const LINUX_TCA_PAD: linux__bindgen_ty_65 = 9;
pub const LINUX_TCA_DUMP_INVISIBLE: linux__bindgen_ty_65 = 10;
pub const LINUX_TCA_CHAIN: linux__bindgen_ty_65 = 11;
pub const LINUX_TCA_HW_OFFLOAD: linux__bindgen_ty_65 = 12;
pub const LINUX_TCA_INGRESS_BLOCK: linux__bindgen_ty_65 = 13;
pub const LINUX_TCA_EGRESS_BLOCK: linux__bindgen_ty_65 = 14;
pub const LINUX_TCA_DUMP_FLAGS: linux__bindgen_ty_65 = 15;
pub const LINUX___TCA_MAX: linux__bindgen_ty_65 = 16;
pub type linux__bindgen_ty_65 = ::core::ffi::c_uint;
pub const LINUX_NDUSEROPT_UNSPEC: linux__bindgen_ty_66 = 0;
pub const LINUX_NDUSEROPT_SRCADDR: linux__bindgen_ty_66 = 1;
pub const LINUX___NDUSEROPT_MAX: linux__bindgen_ty_66 = 2;
pub type linux__bindgen_ty_66 = ::core::ffi::c_uint;
pub const LINUX_TCA_ROOT_UNSPEC: linux__bindgen_ty_67 = 0;
pub const LINUX_TCA_ROOT_TAB: linux__bindgen_ty_67 = 1;
pub const LINUX_TCA_ROOT_FLAGS: linux__bindgen_ty_67 = 2;
pub const LINUX_TCA_ROOT_COUNT: linux__bindgen_ty_67 = 3;
pub const LINUX_TCA_ROOT_TIME_DELTA: linux__bindgen_ty_67 = 4;
pub const LINUX___TCA_ROOT_MAX: linux__bindgen_ty_67 = 5;
pub type linux__bindgen_ty_67 = ::core::ffi::c_uint;
#[doc = " struct linux_clone_args - arguments for the clone3 syscall\n @flags:        Flags for the new process as listed above.\n                All flags are valid except for LINUX_CSIGNAL and\n                LINUX_CLONE_DETACHED.\n @pidfd:        If LINUX_CLONE_PIDFD is set, a pidfd will be\n                returned in this argument.\n @child_tid:    If LINUX_CLONE_CHILD_SETTID is set, the TID of the\n                child process will be returned in the child's\n                memory.\n @parent_tid:   If LINUX_CLONE_PARENT_SETTID is set, the TID of\n                the child process will be returned in the\n                parent's memory.\n @exit_signal:  The exit_signal the parent process will be\n                sent when the child exits.\n @stack:        Specify the location of the stack for the\n                child process.\n                Note, @stack is expected to point to the\n                lowest address. The stack direction will be\n                determined by the kernel and set up\n                appropriately based on @stack_size.\n @stack_size:   The size of the stack for the child process.\n @tls:          If LINUX_CLONE_SETTLS is set, the tls descriptor\n                is set to tls.\n @set_tid:      Pointer to an array of type *pid_t. The size\n                of the array is defined using @set_tid_size.\n                This array is used to select PIDs/TIDs for\n                newly created processes. The first element in\n                this defines the PID in the most nested PID\n                namespace. Each additional element in the array\n                defines the PID in the parent PID namespace of\n                the original PID namespace. If the array has\n                less entries than the number of currently\n                nested PID namespaces only the PIDs in the\n                corresponding namespaces are set.\n @set_tid_size: This defines the size of the array referenced\n                in @set_tid. This cannot be larger than the\n                kernel's limit of nested PID namespaces.\n @cgroup:       If LINUX_CLONE_INTO_CGROUP is specified set this to\n                a file descriptor for the cgroup.\n\n The structure is versioned by size and thus extensible.\n New struct members must go at the end of the struct and\n must be properly 64bit aligned."]
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_clone_args {
    pub flags: linux___u64,
    pub pidfd: linux___u64,
    pub child_tid: linux___u64,
    pub parent_tid: linux___u64,
    pub exit_signal: linux___u64,
    pub stack: linux___u64,
    pub stack_size: linux___u64,
    pub tls: linux___u64,
    pub set_tid: linux___u64,
    pub set_tid_size: linux___u64,
    pub cgroup: linux___u64,
}
#[test]
fn bindgen_test_layout_clone_args() {
    const UNINIT: ::core::mem::MaybeUninit<linux_clone_args> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_clone_args>(),
        88usize,
        concat!("Size of: ", stringify!(linux_clone_args))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_clone_args>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_clone_args))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pidfd) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(pidfd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).child_tid) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(child_tid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).parent_tid) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(parent_tid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).exit_signal) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(exit_signal)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stack) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(stack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).stack_size) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(stack_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tls) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(tls)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).set_tid) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(set_tid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).set_tid_size) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(set_tid_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cgroup) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_clone_args),
            "::",
            stringify!(cgroup)
        )
    );
}
pub type linux_sigset_t = ::core::ffi::c_ulong;
pub type linux___signalfn_t =
    ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_int)>;
pub type linux___sighandler_t = linux___signalfn_t;
pub type linux___restorefn_t = ::core::option::Option<unsafe extern "C" fn()>;
pub type linux___sigrestore_t = linux___restorefn_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_sigaction {
    pub lsa_handler: linux___sighandler_t,
    pub lsa_flags: ::core::ffi::c_ulong,
    pub lsa_restorer: linux___sigrestore_t,
    pub lsa_mask: linux_sigset_t,
}
#[test]
fn bindgen_test_layout_sigaction() {
    const UNINIT: ::core::mem::MaybeUninit<linux_sigaction> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_sigaction>(),
        32usize,
        concat!("Size of: ", stringify!(linux_sigaction))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_sigaction>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_sigaction))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsa_handler) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigaction),
            "::",
            stringify!(lsa_handler)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsa_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigaction),
            "::",
            stringify!(lsa_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsa_restorer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigaction),
            "::",
            stringify!(lsa_restorer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsa_mask) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigaction),
            "::",
            stringify!(lsa_mask)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_sigaltstack {
    pub ss_sp: *mut ::core::ffi::c_void,
    pub ss_flags: ::core::ffi::c_int,
    pub ss_size: linux___kernel_size_t,
}
#[test]
fn bindgen_test_layout_sigaltstack() {
    const UNINIT: ::core::mem::MaybeUninit<linux_sigaltstack> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_sigaltstack>(),
        24usize,
        concat!("Size of: ", stringify!(linux_sigaltstack))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_sigaltstack>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_sigaltstack))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ss_sp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigaltstack),
            "::",
            stringify!(ss_sp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ss_flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigaltstack),
            "::",
            stringify!(ss_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ss_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigaltstack),
            "::",
            stringify!(ss_size)
        )
    );
}
pub type linux_stack_t = linux_sigaltstack;
#[repr(C)]
#[derive(Copy, Clone)]
pub union linux_sigval {
    pub sival_int: ::core::ffi::c_int,
    pub sival_ptr: *mut ::core::ffi::c_void,
}
#[test]
fn bindgen_test_layout_sigval() {
    const UNINIT: ::core::mem::MaybeUninit<linux_sigval> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_sigval>(),
        8usize,
        concat!("Size of: ", stringify!(linux_sigval))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_sigval>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_sigval))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sival_int) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigval),
            "::",
            stringify!(sival_int)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sival_ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigval),
            "::",
            stringify!(sival_ptr)
        )
    );
}
impl ::core::fmt::Debug for linux_sigval {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "linux_sigval {{ union }}")
    }
}
pub type linux_sigval_t = linux_sigval;
#[repr(C)]
#[derive(Copy, Clone)]
pub union linux___sifields {
    pub l_kill: linux___sifields__bindgen_ty_1,
    pub l_timer: linux___sifields__bindgen_ty_2,
    pub l_rt: linux___sifields__bindgen_ty_3,
    pub l_sigchld: linux___sifields__bindgen_ty_4,
    pub l_sigfault: linux___sifields__bindgen_ty_5,
    pub l_sigpoll: linux___sifields__bindgen_ty_6,
    pub l_sigsys: linux___sifields__bindgen_ty_7,
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_1 {
    pub l_pid: linux___kernel_pid_t,
    pub l_uid: linux___kernel_uid32_t,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_1),
            "::",
            stringify!(l_pid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_uid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_1),
            "::",
            stringify!(l_uid)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux___sifields__bindgen_ty_2 {
    pub l_tid: linux___kernel_timer_t,
    pub l_overrun: ::core::ffi::c_int,
    pub l_sigval: linux_sigval_t,
    pub l_sys_private: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_2> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_2>(),
        24usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_2))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_tid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_2),
            "::",
            stringify!(l_tid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_overrun) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_2),
            "::",
            stringify!(l_overrun)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sigval) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_2),
            "::",
            stringify!(l_sigval)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sys_private) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_2),
            "::",
            stringify!(l_sys_private)
        )
    );
}
impl ::core::fmt::Debug for linux___sifields__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "linux___sifields__bindgen_ty_2 {{ l_tid: {:?}, l_overrun: {:?}, l_sigval: {:?}, l_sys_private: {:?} }}" , self . l_tid , self . l_overrun , self . l_sigval , self . l_sys_private)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux___sifields__bindgen_ty_3 {
    pub l_pid: linux___kernel_pid_t,
    pub l_uid: linux___kernel_uid32_t,
    pub l_sigval: linux_sigval_t,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_3() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_3> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_3>(),
        16usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_3))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_3>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_3))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_3),
            "::",
            stringify!(l_pid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_uid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_3),
            "::",
            stringify!(l_uid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sigval) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_3),
            "::",
            stringify!(l_sigval)
        )
    );
}
impl ::core::fmt::Debug for linux___sifields__bindgen_ty_3 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "linux___sifields__bindgen_ty_3 {{ l_pid: {:?}, l_uid: {:?}, l_sigval: {:?} }}",
            self.l_pid, self.l_uid, self.l_sigval
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_4 {
    pub l_pid: linux___kernel_pid_t,
    pub l_uid: linux___kernel_uid32_t,
    pub l_status: ::core::ffi::c_int,
    pub l_utime: linux___kernel_clock_t,
    pub l_stime: linux___kernel_clock_t,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_4() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_4> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_4>(),
        32usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_4))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_4>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_4))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_pid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_4),
            "::",
            stringify!(l_pid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_uid) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_4),
            "::",
            stringify!(l_uid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_status) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_4),
            "::",
            stringify!(l_status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_utime) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_4),
            "::",
            stringify!(l_utime)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_stime) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_4),
            "::",
            stringify!(l_stime)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux___sifields__bindgen_ty_5 {
    pub l_addr: *mut ::core::ffi::c_void,
    pub l__bindgen_anon_1: linux___sifields__bindgen_ty_5__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union linux___sifields__bindgen_ty_5__bindgen_ty_1 {
    pub l_trapno: ::core::ffi::c_int,
    pub l_addr_lsb: ::core::ffi::c_short,
    pub l_addr_bnd: linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
    pub l_addr_pkey: linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2,
    pub l_perf: linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1 {
    pub l_dummy_bnd: [::core::ffi::c_char; 8usize],
    pub l_lower: *mut ::core::ffi::c_void,
    pub l_upper: *mut ::core::ffi::c_void,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<
        linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_dummy_bnd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(l_dummy_bnd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_lower) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(l_lower)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_upper) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(l_upper)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2 {
    pub l_dummy_pkey: [::core::ffi::c_char; 8usize],
    pub l_pkey: linux___u32,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::core::mem::MaybeUninit<
        linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_dummy_pkey) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(l_dummy_pkey)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_pkey) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(l_pkey)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3 {
    pub l_data: ::core::ffi::c_ulong,
    pub l_type: linux___u32,
    pub l_flags: linux___u32,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::core::mem::MaybeUninit<
        linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3,
    > = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(l_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(l_type)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_flags) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(l_flags)
        )
    );
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_5__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_5__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_5__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_trapno) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(l_trapno)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_addr_lsb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(l_addr_lsb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_addr_bnd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(l_addr_bnd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_addr_pkey) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(l_addr_pkey)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_perf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5__bindgen_ty_1),
            "::",
            stringify!(l_perf)
        )
    );
}
impl ::core::fmt::Debug for linux___sifields__bindgen_ty_5__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "linux___sifields__bindgen_ty_5__bindgen_ty_1 {{ union }}"
        )
    }
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_5() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_5> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_5>(),
        32usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_5))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_5>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_5))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_5),
            "::",
            stringify!(l_addr)
        )
    );
}
impl ::core::fmt::Debug for linux___sifields__bindgen_ty_5 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "linux___sifields__bindgen_ty_5 {{ l_addr: {:?}, l__bindgen_anon_1: {:?} }}",
            self.l_addr, self.l__bindgen_anon_1
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_6 {
    pub l_band: ::core::ffi::c_long,
    pub l_fd: ::core::ffi::c_int,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_6() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_6> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_6>(),
        16usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_6))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_6>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_6))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_band) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_6),
            "::",
            stringify!(l_band)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_fd) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_6),
            "::",
            stringify!(l_fd)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux___sifields__bindgen_ty_7 {
    pub l_call_addr: *mut ::core::ffi::c_void,
    pub l_syscall: ::core::ffi::c_int,
    pub l_arch: ::core::ffi::c_uint,
}
#[test]
fn bindgen_test_layout___sifields__bindgen_ty_7() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields__bindgen_ty_7> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields__bindgen_ty_7>(),
        16usize,
        concat!("Size of: ", stringify!(linux___sifields__bindgen_ty_7))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields__bindgen_ty_7>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields__bindgen_ty_7))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_call_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_7),
            "::",
            stringify!(l_call_addr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_syscall) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_7),
            "::",
            stringify!(l_syscall)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_arch) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields__bindgen_ty_7),
            "::",
            stringify!(l_arch)
        )
    );
}
#[test]
fn bindgen_test_layout___sifields() {
    const UNINIT: ::core::mem::MaybeUninit<linux___sifields> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux___sifields>(),
        32usize,
        concat!("Size of: ", stringify!(linux___sifields))
    );
    assert_eq!(
        ::core::mem::align_of::<linux___sifields>(),
        8usize,
        concat!("Alignment of ", stringify!(linux___sifields))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_kill) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_kill)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_timer) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_timer)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_rt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_rt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sigchld) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_sigchld)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sigfault) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_sigfault)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sigpoll) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_sigpoll)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sigsys) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux___sifields),
            "::",
            stringify!(l_sigsys)
        )
    );
}
impl ::core::fmt::Debug for linux___sifields {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "linux___sifields {{ union }}")
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux_siginfo {
    pub l__bindgen_anon_1: linux_siginfo__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union linux_siginfo__bindgen_ty_1 {
    pub l__bindgen_anon_1: linux_siginfo__bindgen_ty_1__bindgen_ty_1,
    pub l_si_pad: [::core::ffi::c_int; 32usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux_siginfo__bindgen_ty_1__bindgen_ty_1 {
    pub lsi_signo: ::core::ffi::c_int,
    pub lsi_errno: ::core::ffi::c_int,
    pub lsi_code: ::core::ffi::c_int,
    pub l_sifields: linux___sifields,
}
#[test]
fn bindgen_test_layout_siginfo__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<linux_siginfo__bindgen_ty_1__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_siginfo__bindgen_ty_1__bindgen_ty_1>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(linux_siginfo__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::core::mem::align_of::<linux_siginfo__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(linux_siginfo__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsi_signo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_siginfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lsi_signo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsi_errno) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_siginfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lsi_errno)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).lsi_code) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_siginfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(lsi_code)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_sifields) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_siginfo__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(l_sifields)
        )
    );
}
impl ::core::fmt::Debug for linux_siginfo__bindgen_ty_1__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "linux_siginfo__bindgen_ty_1__bindgen_ty_1 {{ lsi_signo: {:?}, lsi_errno: {:?}, lsi_code: {:?}, l_sifields: {:?} }}" , self . lsi_signo , self . lsi_errno , self . lsi_code , self . l_sifields)
    }
}
#[test]
fn bindgen_test_layout_siginfo__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<linux_siginfo__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_siginfo__bindgen_ty_1>(),
        128usize,
        concat!("Size of: ", stringify!(linux_siginfo__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_siginfo__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_siginfo__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l_si_pad) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_siginfo__bindgen_ty_1),
            "::",
            stringify!(l_si_pad)
        )
    );
}
impl ::core::fmt::Debug for linux_siginfo__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "linux_siginfo__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_siginfo() {
    assert_eq!(
        ::core::mem::size_of::<linux_siginfo>(),
        128usize,
        concat!("Size of: ", stringify!(linux_siginfo))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_siginfo>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_siginfo))
    );
}
impl ::core::fmt::Debug for linux_siginfo {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(
            f,
            "linux_siginfo {{ l__bindgen_anon_1: {:?} }}",
            self.l__bindgen_anon_1
        )
    }
}
pub type linux_siginfo_t = linux_siginfo;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_new_utsname {
    pub sysname: [::core::ffi::c_char; 65usize],
    pub nodename: [::core::ffi::c_char; 65usize],
    pub release: [::core::ffi::c_char; 65usize],
    pub version: [::core::ffi::c_char; 65usize],
    pub machine: [::core::ffi::c_char; 65usize],
    pub domainname: [::core::ffi::c_char; 65usize],
}
#[test]
fn bindgen_test_layout_new_utsname() {
    const UNINIT: ::core::mem::MaybeUninit<linux_new_utsname> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_new_utsname>(),
        390usize,
        concat!("Size of: ", stringify!(linux_new_utsname))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_new_utsname>(),
        1usize,
        concat!("Alignment of ", stringify!(linux_new_utsname))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sysname) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_new_utsname),
            "::",
            stringify!(sysname)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nodename) as usize - ptr as usize },
        65usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_new_utsname),
            "::",
            stringify!(nodename)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).release) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_new_utsname),
            "::",
            stringify!(release)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        195usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_new_utsname),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).machine) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_new_utsname),
            "::",
            stringify!(machine)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).domainname) as usize - ptr as usize },
        325usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_new_utsname),
            "::",
            stringify!(domainname)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux__fpx_sw_bytes {
    pub magic1: linux___u32,
    pub extended_size: linux___u32,
    pub xfeatures: linux___u64,
    pub xstate_size: linux___u32,
    pub padding: [linux___u32; 7usize],
}
#[test]
fn bindgen_test_layout__fpx_sw_bytes() {
    const UNINIT: ::core::mem::MaybeUninit<linux__fpx_sw_bytes> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux__fpx_sw_bytes>(),
        48usize,
        concat!("Size of: ", stringify!(linux__fpx_sw_bytes))
    );
    assert_eq!(
        ::core::mem::align_of::<linux__fpx_sw_bytes>(),
        8usize,
        concat!("Alignment of ", stringify!(linux__fpx_sw_bytes))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).magic1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpx_sw_bytes),
            "::",
            stringify!(magic1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).extended_size) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpx_sw_bytes),
            "::",
            stringify!(extended_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xfeatures) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpx_sw_bytes),
            "::",
            stringify!(xfeatures)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xstate_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpx_sw_bytes),
            "::",
            stringify!(xstate_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).padding) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpx_sw_bytes),
            "::",
            stringify!(padding)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux__fpstate_64 {
    pub cwd: linux___u16,
    pub swd: linux___u16,
    pub twd: linux___u16,
    pub fop: linux___u16,
    pub rip: linux___u64,
    pub rdp: linux___u64,
    pub mxcsr: linux___u32,
    pub mxcsr_mask: linux___u32,
    pub st_space: [linux___u32; 32usize],
    pub xmm_space: [linux___u32; 64usize],
    pub reserved2: [linux___u32; 12usize],
    pub l__bindgen_anon_1: linux__fpstate_64__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union linux__fpstate_64__bindgen_ty_1 {
    pub reserved3: [linux___u32; 12usize],
    pub sw_reserved: linux__fpx_sw_bytes,
}
#[test]
fn bindgen_test_layout__fpstate_64__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<linux__fpstate_64__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux__fpstate_64__bindgen_ty_1>(),
        48usize,
        concat!("Size of: ", stringify!(linux__fpstate_64__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<linux__fpstate_64__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(linux__fpstate_64__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved3) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64__bindgen_ty_1),
            "::",
            stringify!(reserved3)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).sw_reserved) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64__bindgen_ty_1),
            "::",
            stringify!(sw_reserved)
        )
    );
}
impl ::core::fmt::Debug for linux__fpstate_64__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "linux__fpstate_64__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout__fpstate_64() {
    const UNINIT: ::core::mem::MaybeUninit<linux__fpstate_64> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux__fpstate_64>(),
        512usize,
        concat!("Size of: ", stringify!(linux__fpstate_64))
    );
    assert_eq!(
        ::core::mem::align_of::<linux__fpstate_64>(),
        8usize,
        concat!("Alignment of ", stringify!(linux__fpstate_64))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cwd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64),
            "::",
            stringify!(cwd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).swd) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64),
            "::",
            stringify!(swd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).twd) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64),
            "::",
            stringify!(twd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fop) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64),
            "::",
            stringify!(fop)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rip) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64),
            "::",
            stringify!(rip)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rdp) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64),
            "::",
            stringify!(rdp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mxcsr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64),
            "::",
            stringify!(mxcsr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mxcsr_mask) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64),
            "::",
            stringify!(mxcsr_mask)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_space) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64),
            "::",
            stringify!(st_space)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).xmm_space) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64),
            "::",
            stringify!(xmm_space)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved2) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(linux__fpstate_64),
            "::",
            stringify!(reserved2)
        )
    );
}
impl ::core::fmt::Debug for linux__fpstate_64 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "linux__fpstate_64 {{ cwd: {:?}, swd: {:?}, twd: {:?}, fop: {:?}, rip: {:?}, rdp: {:?}, mxcsr: {:?}, mxcsr_mask: {:?}, st_space: {:?}, xmm_space: {:?}, reserved2: {:?}, l__bindgen_anon_1: {:?} }}" , self . cwd , self . swd , self . twd , self . fop , self . rip , self . rdp , self . mxcsr , self . mxcsr_mask , self . st_space , self . xmm_space , self . reserved2 , self . l__bindgen_anon_1)
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux_sigcontext {
    pub r8: linux___u64,
    pub r9: linux___u64,
    pub r10: linux___u64,
    pub r11: linux___u64,
    pub r12: linux___u64,
    pub r13: linux___u64,
    pub r14: linux___u64,
    pub r15: linux___u64,
    pub rdi: linux___u64,
    pub rsi: linux___u64,
    pub rbp: linux___u64,
    pub rbx: linux___u64,
    pub rdx: linux___u64,
    pub rax: linux___u64,
    pub rcx: linux___u64,
    pub rsp: linux___u64,
    pub rip: linux___u64,
    pub eflags: linux___u64,
    pub cs: linux___u16,
    pub gs: linux___u16,
    pub fs: linux___u16,
    pub l__bindgen_anon_1: linux_sigcontext__bindgen_ty_1,
    pub err: linux___u64,
    pub trapno: linux___u64,
    pub oldmask: linux___u64,
    pub cr2: linux___u64,
    pub fpstate: *mut linux__fpstate_64,
    pub reserved1: [linux___u64; 8usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union linux_sigcontext__bindgen_ty_1 {
    pub ss: linux___u16,
    pub l__pad0: linux___u16,
}
#[test]
fn bindgen_test_layout_sigcontext__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<linux_sigcontext__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_sigcontext__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(linux_sigcontext__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_sigcontext__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(linux_sigcontext__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ss) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext__bindgen_ty_1),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l__pad0) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext__bindgen_ty_1),
            "::",
            stringify!(l__pad0)
        )
    );
}
impl ::core::fmt::Debug for linux_sigcontext__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write!(f, "linux_sigcontext__bindgen_ty_1 {{ union }}")
    }
}
#[test]
fn bindgen_test_layout_sigcontext() {
    const UNINIT: ::core::mem::MaybeUninit<linux_sigcontext> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_sigcontext>(),
        256usize,
        concat!("Size of: ", stringify!(linux_sigcontext))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_sigcontext>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_sigcontext))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(r8)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r9) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(r9)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r10) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(r10)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r11) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(r11)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r12) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(r12)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r13) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(r13)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r14) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(r14)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).r15) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(r15)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rdi) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(rdi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rsi) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(rsi)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rbp) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(rbp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rbx) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(rbx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rdx) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(rdx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rax) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(rax)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rcx) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(rcx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rsp) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(rsp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rip) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(rip)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).eflags) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(eflags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cs) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(cs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).gs) as usize - ptr as usize },
        146usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(gs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fs) as usize - ptr as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(fs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).err) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(err)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).trapno) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(trapno)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).oldmask) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(oldmask)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cr2) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(cr2)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fpstate) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(fpstate)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved1) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_sigcontext),
            "::",
            stringify!(reserved1)
        )
    );
}
impl ::core::fmt::Debug for linux_sigcontext {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "linux_sigcontext {{ r8: {:?}, r9: {:?}, r10: {:?}, r11: {:?}, r12: {:?}, r13: {:?}, r14: {:?}, r15: {:?}, rdi: {:?}, rsi: {:?}, rbp: {:?}, rbx: {:?}, rdx: {:?}, rax: {:?}, rcx: {:?}, rsp: {:?}, rip: {:?}, eflags: {:?}, cs: {:?}, gs: {:?}, fs: {:?}, l__bindgen_anon_1: {:?}, err: {:?}, trapno: {:?}, oldmask: {:?}, cr2: {:?}, fpstate: {:?}, reserved1: {:?} }}" , self . r8 , self . r9 , self . r10 , self . r11 , self . r12 , self . r13 , self . r14 , self . r15 , self . rdi , self . rsi , self . rbp , self . rbx , self . rdx , self . rax , self . rcx , self . rsp , self . rip , self . eflags , self . cs , self . gs , self . fs , self . l__bindgen_anon_1 , self . err , self . trapno , self . oldmask , self . cr2 , self . fpstate , self . reserved1)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_stat {
    pub st_dev: linux___kernel_ulong_t,
    pub st_ino: linux___kernel_ulong_t,
    pub st_nlink: linux___kernel_ulong_t,
    pub st_mode: ::core::ffi::c_uint,
    pub st_uid: ::core::ffi::c_uint,
    pub st_gid: ::core::ffi::c_uint,
    pub l__pad0: ::core::ffi::c_uint,
    pub st_rdev: linux___kernel_ulong_t,
    pub st_size: linux___kernel_long_t,
    pub st_blksize: linux___kernel_long_t,
    pub st_blocks: linux___kernel_long_t,
    pub st_atime: linux___kernel_ulong_t,
    pub st_atime_nsec: linux___kernel_ulong_t,
    pub st_mtime: linux___kernel_ulong_t,
    pub st_mtime_nsec: linux___kernel_ulong_t,
    pub st_ctime: linux___kernel_ulong_t,
    pub st_ctime_nsec: linux___kernel_ulong_t,
    pub l__unused: [linux___kernel_long_t; 3usize],
}
#[test]
fn bindgen_test_layout_stat() {
    const UNINIT: ::core::mem::MaybeUninit<linux_stat> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_stat>(),
        144usize,
        concat!("Size of: ", stringify!(linux_stat))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_stat>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_stat))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_dev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_dev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_ino) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_ino)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_nlink) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_nlink)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_mode) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_uid) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_uid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_gid) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_gid)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l__pad0) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(l__pad0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_rdev) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_rdev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_size) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_blksize) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_blksize)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_blocks) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_blocks)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_atime) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_atime)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_atime_nsec) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_atime_nsec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_mtime) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_mtime)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_mtime_nsec) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_mtime_nsec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_ctime) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_ctime)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).st_ctime_nsec) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(st_ctime_nsec)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).l__unused) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_stat),
            "::",
            stringify!(l__unused)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct linux_ucontext {
    pub uc_flags: ::core::ffi::c_ulong,
    pub uc_link: *mut linux_ucontext,
    pub uc_stack: linux_stack_t,
    pub uc_mcontext: linux_sigcontext,
    pub uc_sigmask: linux_sigset_t,
}
#[test]
fn bindgen_test_layout_ucontext() {
    const UNINIT: ::core::mem::MaybeUninit<linux_ucontext> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_ucontext>(),
        304usize,
        concat!("Size of: ", stringify!(linux_ucontext))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_ucontext>(),
        8usize,
        concat!("Alignment of ", stringify!(linux_ucontext))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uc_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_ucontext),
            "::",
            stringify!(uc_flags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uc_link) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_ucontext),
            "::",
            stringify!(uc_link)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uc_stack) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_ucontext),
            "::",
            stringify!(uc_stack)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uc_mcontext) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_ucontext),
            "::",
            stringify!(uc_mcontext)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).uc_sigmask) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_ucontext),
            "::",
            stringify!(uc_sigmask)
        )
    );
}
impl ::core::fmt::Debug for linux_ucontext {
    fn fmt(&self, f: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        write ! (f , "linux_ucontext {{ uc_flags: {:?}, uc_link: {:?}, uc_stack: {:?}, uc_mcontext: {:?}, uc_sigmask: {:?} }}" , self . uc_flags , self . uc_link , self . uc_stack , self . uc_mcontext , self . uc_sigmask)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct linux_pollfd {
    pub fd: ::core::ffi::c_int,
    pub events: ::core::ffi::c_short,
    pub revents: ::core::ffi::c_short,
}
#[test]
fn bindgen_test_layout_pollfd() {
    const UNINIT: ::core::mem::MaybeUninit<linux_pollfd> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<linux_pollfd>(),
        8usize,
        concat!("Size of: ", stringify!(linux_pollfd))
    );
    assert_eq!(
        ::core::mem::align_of::<linux_pollfd>(),
        4usize,
        concat!("Alignment of ", stringify!(linux_pollfd))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).fd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_pollfd),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).events) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_pollfd),
            "::",
            stringify!(events)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).revents) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(linux_pollfd),
            "::",
            stringify!(revents)
        )
    );
}
pub const LINUX_sock_shutdown_cmd_SHUT_RD: linux_sock_shutdown_cmd = 0;
pub const LINUX_sock_shutdown_cmd_SHUT_WR: linux_sock_shutdown_cmd = 1;
pub const LINUX_sock_shutdown_cmd_SHUT_RDWR: linux_sock_shutdown_cmd = 2;
pub type linux_sock_shutdown_cmd = ::core::ffi::c_uint;
